/* automatically generated by rust-bindgen 0.66.0 */

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub const MA_VERSION_MAJOR: u32 = 0;
pub const MA_VERSION_MINOR: u32 = 11;
pub const MA_VERSION_REVISION: u32 = 17;
pub const MA_SIZEOF_PTR: u32 = 8;
pub type wchar_t = ::std::os::raw::c_int;

pub const __WATCHOS_9_1: u32 = 90100;
pub const MAC_OS_X_VERSION_10_0: u32 = 1000;
pub const MAC_OS_X_VERSION_10_1: u32 = 1010;
pub const MAC_OS_X_VERSION_10_2: u32 = 1020;
pub const MAC_OS_X_VERSION_10_3: u32 = 1030;
pub const MAC_OS_X_VERSION_10_4: u32 = 1040;
pub const MAC_OS_X_VERSION_10_5: u32 = 1050;
pub const MAC_OS_X_VERSION_10_6: u32 = 1060;
pub const MAC_OS_X_VERSION_10_7: u32 = 1070;
pub const MAC_OS_X_VERSION_10_8: u32 = 1080;
pub const MAC_OS_X_VERSION_10_9: u32 = 1090;
pub const MAC_OS_X_VERSION_10_10: u32 = 101000;
pub const MAC_OS_X_VERSION_10_10_2: u32 = 101002;
pub const MAC_OS_X_VERSION_10_10_3: u32 = 101003;
pub const MAC_OS_X_VERSION_10_11: u32 = 101100;
pub const MAC_OS_X_VERSION_10_11_2: u32 = 101102;
pub const MAC_OS_X_VERSION_10_11_3: u32 = 101103;
pub const MAC_OS_X_VERSION_10_11_4: u32 = 101104;
pub const MAC_OS_X_VERSION_10_12: u32 = 101200;
pub const MAC_OS_X_VERSION_10_12_1: u32 = 101201;
pub const MAC_OS_X_VERSION_10_12_2: u32 = 101202;
pub const MAC_OS_X_VERSION_10_12_4: u32 = 101204;
pub const MAC_OS_X_VERSION_10_13: u32 = 101300;
pub const MAC_OS_X_VERSION_10_13_1: u32 = 101301;
pub const MAC_OS_X_VERSION_10_13_2: u32 = 101302;
pub const MAC_OS_X_VERSION_10_13_4: u32 = 101304;
pub const MAC_OS_X_VERSION_10_14: u32 = 101400;
pub const MAC_OS_X_VERSION_10_14_1: u32 = 101401;
pub const MAC_OS_X_VERSION_10_14_4: u32 = 101404;
pub const MAC_OS_X_VERSION_10_14_6: u32 = 101406;
pub const MAC_OS_X_VERSION_10_15: u32 = 101500;
pub const MAC_OS_X_VERSION_10_15_1: u32 = 101501;
pub const MAC_OS_X_VERSION_10_16: u32 = 101600;
pub const MAC_OS_VERSION_11_0: u32 = 110000;
pub const MAC_OS_VERSION_12_0: u32 = 120000;
pub const MAC_OS_VERSION_13_0: u32 = 130000;
pub const __DRIVERKIT_19_0: u32 = 190000;
pub const __DRIVERKIT_20_0: u32 = 200000;
pub const __DRIVERKIT_21_0: u32 = 210000;
pub const __MAC_OS_X_VERSION_MAX_ALLOWED: u32 = 130000;
pub const __ENABLE_LEGACY_MAC_AVAILABILITY: u32 = 1;
pub const TIME_UTC: u32 = 1;
pub type max_align_t = f64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
pub struct __mbstate_t {
    pub __mbstate8: __BindgenUnionField<[::std::os::raw::c_char; 128usize]>,
    pub _mbstateL: __BindgenUnionField<::std::os::raw::c_longlong>,
    pub bindgen_union_field: [u64; 16usize],
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mbstateL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    const UNINIT: ::std::mem::MaybeUninit<__darwin_pthread_handler_rec> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__routine) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_attr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_cond_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_condattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutex_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutexattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_once_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlock_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlockattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cleanup_stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
#[repr(C)]
#[derive(Debug)]
pub struct sched_param {
    pub sched_priority: ::std::os::raw::c_int,
    pub __opaque: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_sched_param() {
    const UNINIT: ::std::mem::MaybeUninit<sched_param> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sched_param>(),
        8usize,
        concat!("Size of: ", stringify!(sched_param))
    );
    assert_eq!(
        ::std::mem::align_of::<sched_param>(),
        4usize,
        concat!("Alignment of ", stringify!(sched_param))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sched_priority) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sched_param),
            "::",
            stringify!(sched_priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sched_param),
            "::",
            stringify!(__opaque)
        )
    );
}
extern "C" {
    pub fn sched_yield() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_get_priority_min(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sched_get_priority_max(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type clock_t = __darwin_clock_t;
pub type time_t = __darwin_time_t;
#[repr(C)]
#[derive(Debug)]
pub struct timespec {
    pub tv_sec: __darwin_time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut getdate_err: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub fn asctime(arg1: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn ctime(arg1: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn difftime(arg1: time_t, arg2: time_t) -> f64;
}
extern "C" {
    pub fn getdate(arg1: *const ::std::os::raw::c_char) -> *mut tm;
}
extern "C" {
    pub fn gmtime(arg1: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(arg1: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn mktime(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn strptime(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut tm,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn time(arg1: *mut time_t) -> time_t;
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub fn asctime_r(
        arg1: *const tm,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        arg1: *const time_t,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gmtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn posix2time(arg1: time_t) -> time_t;
}
extern "C" {
    pub fn tzsetwall();
}
extern "C" {
    pub fn time2posix(arg1: time_t) -> time_t;
}
extern "C" {
    pub fn timelocal(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn timegm(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn nanosleep(__rqtp: *const timespec, __rmtp: *mut timespec) -> ::std::os::raw::c_int;
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum clockid_t {
    _CLOCK_REALTIME = 0,
    _CLOCK_MONOTONIC = 6,
    _CLOCK_MONOTONIC_RAW = 4,
    _CLOCK_MONOTONIC_RAW_APPROX = 5,
    _CLOCK_UPTIME_RAW = 8,
    _CLOCK_UPTIME_RAW_APPROX = 9,
    _CLOCK_PROCESS_CPUTIME_ID = 12,
    _CLOCK_THREAD_CPUTIME_ID = 16,
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime_nsec_np(__clock_id: clockid_t) -> __uint64_t;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(ts: *mut timespec, base: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type pthread_attr_t = __darwin_pthread_attr_t;
pub type pthread_cond_t = __darwin_pthread_cond_t;
pub type pthread_condattr_t = __darwin_pthread_condattr_t;
pub type pthread_key_t = __darwin_pthread_key_t;
pub type pthread_mutex_t = __darwin_pthread_mutex_t;
pub type pthread_mutexattr_t = __darwin_pthread_mutexattr_t;
pub type pthread_once_t = __darwin_pthread_once_t;
pub type pthread_rwlock_t = __darwin_pthread_rwlock_t;
pub type pthread_rwlockattr_t = __darwin_pthread_rwlockattr_t;
pub type pthread_t = __darwin_pthread_t;
pub const QOS_CLASS_USER_INTERACTIVE: _bindgen_ty_1 = _bindgen_ty_1::QOS_CLASS_USER_INTERACTIVE;
pub const QOS_CLASS_USER_INITIATED: _bindgen_ty_1 = _bindgen_ty_1::QOS_CLASS_USER_INITIATED;
pub const QOS_CLASS_DEFAULT: _bindgen_ty_1 = _bindgen_ty_1::QOS_CLASS_DEFAULT;
pub const QOS_CLASS_UTILITY: _bindgen_ty_1 = _bindgen_ty_1::QOS_CLASS_UTILITY;
pub const QOS_CLASS_BACKGROUND: _bindgen_ty_1 = _bindgen_ty_1::QOS_CLASS_BACKGROUND;
pub const QOS_CLASS_UNSPECIFIED: _bindgen_ty_1 = _bindgen_ty_1::QOS_CLASS_UNSPECIFIED;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_1 {
    QOS_CLASS_USER_INTERACTIVE = 33,
    QOS_CLASS_USER_INITIATED = 25,
    QOS_CLASS_DEFAULT = 21,
    QOS_CLASS_UTILITY = 17,
    QOS_CLASS_BACKGROUND = 9,
    QOS_CLASS_UNSPECIFIED = 0,
}
pub type qos_class_t = ::std::os::raw::c_uint;
pub const QOS_MIN_RELATIVE_PRIORITY: i32 = -15;
extern "C" {
    pub fn qos_class_self() -> qos_class_t;
}
extern "C" {
    pub fn qos_class_main() -> qos_class_t;
}
extern "C" {
    pub fn pthread_attr_set_qos_class_np(
        __attr: *mut pthread_attr_t,
        __qos_class: qos_class_t,
        __relative_priority: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_get_qos_class_np(
        __attr: *mut pthread_attr_t,
        __qos_class: *mut qos_class_t,
        __relative_priority: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_set_qos_class_self_np(
        __qos_class: qos_class_t,
        __relative_priority: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_get_qos_class_np(
        __pthread: pthread_t,
        __qos_class: *mut qos_class_t,
        __relative_priority: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug)]
pub struct pthread_override_s {
    _unused: [u8; 0],
}
pub type pthread_override_t = *mut pthread_override_s;
extern "C" {
    pub fn pthread_override_qos_class_start_np(
        __pthread: pthread_t,
        __qos_class: qos_class_t,
        __relative_priority: ::std::os::raw::c_int,
    ) -> pthread_override_t;
}
extern "C" {
    pub fn pthread_override_qos_class_end_np(
        __override: pthread_override_t,
    ) -> ::std::os::raw::c_int;
}
pub type mach_port_t = __darwin_mach_port_t;
pub type sigset_t = __darwin_sigset_t;
pub const PTHREAD_CREATE_JOINABLE: u32 = 1;
pub const PTHREAD_CREATE_DETACHED: u32 = 2;
pub const PTHREAD_INHERIT_SCHED: u32 = 1;
pub const PTHREAD_EXPLICIT_SCHED: u32 = 2;
pub const PTHREAD_CANCEL_ENABLE: u32 = 1;
pub const PTHREAD_CANCEL_DISABLE: u32 = 0;
pub const PTHREAD_CANCEL_DEFERRED: u32 = 2;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: u32 = 0;
pub const PTHREAD_SCOPE_SYSTEM: u32 = 1;
pub const PTHREAD_SCOPE_PROCESS: u32 = 2;
pub const PTHREAD_PROCESS_SHARED: u32 = 1;
pub const PTHREAD_PROCESS_PRIVATE: u32 = 2;
pub const PTHREAD_PRIO_NONE: u32 = 0;
pub const PTHREAD_PRIO_INHERIT: u32 = 1;
pub const PTHREAD_PRIO_PROTECT: u32 = 2;
pub const PTHREAD_MUTEX_NORMAL: u32 = 0;
pub const PTHREAD_MUTEX_ERRORCHECK: u32 = 1;
pub const PTHREAD_MUTEX_RECURSIVE: u32 = 2;
pub const PTHREAD_MUTEX_DEFAULT: u32 = 0;
pub const PTHREAD_MUTEX_POLICY_FAIRSHARE_NP: u32 = 1;
pub const PTHREAD_MUTEX_POLICY_FIRSTFIT_NP: u32 = 3;
extern "C" {
    pub fn pthread_atfork(
        arg1: ::std::option::Option<unsafe extern "C" fn()>,
        arg2: ::std::option::Option<unsafe extern "C" fn()>,
        arg3: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_destroy(arg1: *mut pthread_attr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getdetachstate(
        arg1: *const pthread_attr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getguardsize(
        arg1: *const pthread_attr_t,
        arg2: *mut usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getinheritsched(
        arg1: *const pthread_attr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedparam(
        arg1: *const pthread_attr_t,
        arg2: *mut sched_param,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedpolicy(
        arg1: *const pthread_attr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getscope(
        arg1: *const pthread_attr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getstack(
        arg1: *const pthread_attr_t,
        arg2: *mut *mut ::std::os::raw::c_void,
        arg3: *mut usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getstackaddr(
        arg1: *const pthread_attr_t,
        arg2: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_getstacksize(
        arg1: *const pthread_attr_t,
        arg2: *mut usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_init(arg1: *mut pthread_attr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setdetachstate(
        arg1: *mut pthread_attr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setguardsize(
        arg1: *mut pthread_attr_t,
        arg2: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setinheritsched(
        arg1: *mut pthread_attr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedparam(
        arg1: *mut pthread_attr_t,
        arg2: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedpolicy(
        arg1: *mut pthread_attr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setscope(
        arg1: *mut pthread_attr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setstack(
        arg1: *mut pthread_attr_t,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setstackaddr(
        arg1: *mut pthread_attr_t,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_attr_setstacksize(
        arg1: *mut pthread_attr_t,
        arg2: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cancel(arg1: pthread_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_broadcast(arg1: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_destroy(arg1: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_init(
        arg1: *mut pthread_cond_t,
        arg2: *const pthread_condattr_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_signal(arg1: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_timedwait(
        arg1: *mut pthread_cond_t,
        arg2: *mut pthread_mutex_t,
        arg3: *const timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_wait(
        arg1: *mut pthread_cond_t,
        arg2: *mut pthread_mutex_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_condattr_destroy(arg1: *mut pthread_condattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_condattr_init(arg1: *mut pthread_condattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_condattr_getpshared(
        arg1: *const pthread_condattr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_condattr_setpshared(
        arg1: *mut pthread_condattr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_create(
        arg1: *mut pthread_t,
        arg2: *const pthread_attr_t,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
        >,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_detach(arg1: pthread_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_equal(arg1: pthread_t, arg2: pthread_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_exit(arg1: *mut ::std::os::raw::c_void) -> !;
}
extern "C" {
    pub fn pthread_getconcurrency() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getschedparam(
        arg1: pthread_t,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut sched_param,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getspecific(arg1: pthread_key_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pthread_join(
        arg1: pthread_t,
        arg2: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_key_create(
        arg1: *mut pthread_key_t,
        arg2: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_key_delete(arg1: pthread_key_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_destroy(arg1: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_getprioceiling(
        arg1: *const pthread_mutex_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_init(
        arg1: *mut pthread_mutex_t,
        arg2: *const pthread_mutexattr_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_lock(arg1: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_setprioceiling(
        arg1: *mut pthread_mutex_t,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_trylock(arg1: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutex_unlock(arg1: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_destroy(arg1: *mut pthread_mutexattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getprioceiling(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getprotocol(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getpshared(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_gettype(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getpolicy_np(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_init(arg1: *mut pthread_mutexattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setprioceiling(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setprotocol(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setpshared(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_settype(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setpolicy_np(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_once(
        arg1: *mut pthread_once_t,
        arg2: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_destroy(arg1: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_init(
        arg1: *mut pthread_rwlock_t,
        arg2: *const pthread_rwlockattr_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_rdlock(arg1: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_tryrdlock(arg1: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_trywrlock(arg1: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_wrlock(arg1: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlock_unlock(arg1: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_destroy(arg1: *mut pthread_rwlockattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_getpshared(
        arg1: *const pthread_rwlockattr_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_init(arg1: *mut pthread_rwlockattr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_setpshared(
        arg1: *mut pthread_rwlockattr_t,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_self() -> pthread_t;
}
extern "C" {
    pub fn pthread_setcancelstate(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setcanceltype(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setconcurrency(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setschedparam(
        arg1: pthread_t,
        arg2: ::std::os::raw::c_int,
        arg3: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setspecific(
        arg1: pthread_key_t,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_testcancel();
}
extern "C" {
    pub fn pthread_is_threaded_np() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_threadid_np(arg1: pthread_t, arg2: *mut __uint64_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getname_np(
        arg1: pthread_t,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setname_np(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_main_np() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_mach_thread_np(arg1: pthread_t) -> mach_port_t;
}
extern "C" {
    pub fn pthread_get_stacksize_np(arg1: pthread_t) -> usize;
}
extern "C" {
    pub fn pthread_get_stackaddr_np(arg1: pthread_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pthread_cond_signal_thread_np(
        arg1: *mut pthread_cond_t,
        arg2: pthread_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_cond_timedwait_relative_np(
        arg1: *mut pthread_cond_t,
        arg2: *mut pthread_mutex_t,
        arg3: *const timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_create_suspended_np(
        arg1: *mut pthread_t,
        arg2: *const pthread_attr_t,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
        >,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_kill(arg1: pthread_t, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_from_mach_thread_np(arg1: mach_port_t) -> pthread_t;
}
extern "C" {
    pub fn pthread_sigmask(
        arg1: ::std::os::raw::c_int,
        arg2: *const sigset_t,
        arg3: *mut sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_yield_np();
}
extern "C" {
    pub fn pthread_jit_write_protect_np(enabled: ::std::os::raw::c_int);
}
extern "C" {
    pub fn pthread_jit_write_protect_supported_np() -> ::std::os::raw::c_int;
}
pub type pthread_jit_write_callback_t = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn pthread_jit_write_with_callback_np(
        callback: pthread_jit_write_callback_t,
        ctx: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_jit_write_freeze_callbacks_np();
}
extern "C" {
    pub fn pthread_cpu_number_np(cpu_number_out: *mut usize) -> ::std::os::raw::c_int;
}
pub type ma_pthread_t = pthread_t;
pub type ma_pthread_mutex_t = pthread_mutex_t;
pub type ma_pthread_cond_t = pthread_cond_t;
pub const MA_SIMD_ALIGNMENT: u32 = 32;
pub type ma_wchar_win32 = ma_uint16;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_log_level {
    MA_LOG_LEVEL_DEBUG = 4,
    MA_LOG_LEVEL_INFO = 3,
    MA_LOG_LEVEL_WARNING = 2,
    MA_LOG_LEVEL_ERROR = 1,
}
pub const __alignas_is_defined: u32 = 1;
pub const __alignof_is_defined: u32 = 1;
pub type ma_channel = ma_uint8;
impl _ma_channel_position {
    pub const MA_CHANNEL_LEFT: _ma_channel_position = _ma_channel_position::MA_CHANNEL_FRONT_LEFT;
}
impl _ma_channel_position {
    pub const MA_CHANNEL_RIGHT: _ma_channel_position = _ma_channel_position::MA_CHANNEL_FRONT_RIGHT;
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum _ma_channel_position {
    MA_CHANNEL_NONE = 0,
    MA_CHANNEL_MONO = 1,
    MA_CHANNEL_FRONT_LEFT = 2,
    MA_CHANNEL_FRONT_RIGHT = 3,
    MA_CHANNEL_FRONT_CENTER = 4,
    MA_CHANNEL_LFE = 5,
    MA_CHANNEL_BACK_LEFT = 6,
    MA_CHANNEL_BACK_RIGHT = 7,
    MA_CHANNEL_FRONT_LEFT_CENTER = 8,
    MA_CHANNEL_FRONT_RIGHT_CENTER = 9,
    MA_CHANNEL_BACK_CENTER = 10,
    MA_CHANNEL_SIDE_LEFT = 11,
    MA_CHANNEL_SIDE_RIGHT = 12,
    MA_CHANNEL_TOP_CENTER = 13,
    MA_CHANNEL_TOP_FRONT_LEFT = 14,
    MA_CHANNEL_TOP_FRONT_CENTER = 15,
    MA_CHANNEL_TOP_FRONT_RIGHT = 16,
    MA_CHANNEL_TOP_BACK_LEFT = 17,
    MA_CHANNEL_TOP_BACK_CENTER = 18,
    MA_CHANNEL_TOP_BACK_RIGHT = 19,
    MA_CHANNEL_AUX_0 = 20,
    MA_CHANNEL_AUX_1 = 21,
    MA_CHANNEL_AUX_2 = 22,
    MA_CHANNEL_AUX_3 = 23,
    MA_CHANNEL_AUX_4 = 24,
    MA_CHANNEL_AUX_5 = 25,
    MA_CHANNEL_AUX_6 = 26,
    MA_CHANNEL_AUX_7 = 27,
    MA_CHANNEL_AUX_8 = 28,
    MA_CHANNEL_AUX_9 = 29,
    MA_CHANNEL_AUX_10 = 30,
    MA_CHANNEL_AUX_11 = 31,
    MA_CHANNEL_AUX_12 = 32,
    MA_CHANNEL_AUX_13 = 33,
    MA_CHANNEL_AUX_14 = 34,
    MA_CHANNEL_AUX_15 = 35,
    MA_CHANNEL_AUX_16 = 36,
    MA_CHANNEL_AUX_17 = 37,
    MA_CHANNEL_AUX_18 = 38,
    MA_CHANNEL_AUX_19 = 39,
    MA_CHANNEL_AUX_20 = 40,
    MA_CHANNEL_AUX_21 = 41,
    MA_CHANNEL_AUX_22 = 42,
    MA_CHANNEL_AUX_23 = 43,
    MA_CHANNEL_AUX_24 = 44,
    MA_CHANNEL_AUX_25 = 45,
    MA_CHANNEL_AUX_26 = 46,
    MA_CHANNEL_AUX_27 = 47,
    MA_CHANNEL_AUX_28 = 48,
    MA_CHANNEL_AUX_29 = 49,
    MA_CHANNEL_AUX_30 = 50,
    MA_CHANNEL_AUX_31 = 51,
    MA_CHANNEL_POSITION_COUNT = 52,
}
#[repr(i32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_result {
    MA_SUCCESS = 0,
    MA_ERROR = -1,
    MA_INVALID_ARGS = -2,
    MA_INVALID_OPERATION = -3,
    MA_OUT_OF_MEMORY = -4,
    MA_OUT_OF_RANGE = -5,
    MA_ACCESS_DENIED = -6,
    MA_DOES_NOT_EXIST = -7,
    MA_ALREADY_EXISTS = -8,
    MA_TOO_MANY_OPEN_FILES = -9,
    MA_INVALID_FILE = -10,
    MA_TOO_BIG = -11,
    MA_PATH_TOO_LONG = -12,
    MA_NAME_TOO_LONG = -13,
    MA_NOT_DIRECTORY = -14,
    MA_IS_DIRECTORY = -15,
    MA_DIRECTORY_NOT_EMPTY = -16,
    MA_AT_END = -17,
    MA_NO_SPACE = -18,
    MA_BUSY = -19,
    MA_IO_ERROR = -20,
    MA_INTERRUPT = -21,
    MA_UNAVAILABLE = -22,
    MA_ALREADY_IN_USE = -23,
    MA_BAD_ADDRESS = -24,
    MA_BAD_SEEK = -25,
    MA_BAD_PIPE = -26,
    MA_DEADLOCK = -27,
    MA_TOO_MANY_LINKS = -28,
    MA_NOT_IMPLEMENTED = -29,
    MA_NO_MESSAGE = -30,
    MA_BAD_MESSAGE = -31,
    MA_NO_DATA_AVAILABLE = -32,
    MA_INVALID_DATA = -33,
    MA_TIMEOUT = -34,
    MA_NO_NETWORK = -35,
    MA_NOT_UNIQUE = -36,
    MA_NOT_SOCKET = -37,
    MA_NO_ADDRESS = -38,
    MA_BAD_PROTOCOL = -39,
    MA_PROTOCOL_UNAVAILABLE = -40,
    MA_PROTOCOL_NOT_SUPPORTED = -41,
    MA_PROTOCOL_FAMILY_NOT_SUPPORTED = -42,
    MA_ADDRESS_FAMILY_NOT_SUPPORTED = -43,
    MA_SOCKET_NOT_SUPPORTED = -44,
    MA_CONNECTION_RESET = -45,
    MA_ALREADY_CONNECTED = -46,
    MA_NOT_CONNECTED = -47,
    MA_CONNECTION_REFUSED = -48,
    MA_NO_HOST = -49,
    MA_IN_PROGRESS = -50,
    MA_CANCELLED = -51,
    MA_MEMORY_ALREADY_MAPPED = -52,
    MA_CRC_MISMATCH = -100,
    MA_FORMAT_NOT_SUPPORTED = -200,
    MA_DEVICE_TYPE_NOT_SUPPORTED = -201,
    MA_SHARE_MODE_NOT_SUPPORTED = -202,
    MA_NO_BACKEND = -203,
    MA_NO_DEVICE = -204,
    MA_API_NOT_FOUND = -205,
    MA_INVALID_DEVICE_CONFIG = -206,
    MA_LOOP = -207,
    MA_BACKEND_NOT_ENABLED = -208,
    MA_DEVICE_NOT_INITIALIZED = -300,
    MA_DEVICE_ALREADY_INITIALIZED = -301,
    MA_DEVICE_NOT_STARTED = -302,
    MA_DEVICE_NOT_STOPPED = -303,
    MA_FAILED_TO_INIT_BACKEND = -400,
    MA_FAILED_TO_OPEN_BACKEND_DEVICE = -401,
    MA_FAILED_TO_START_BACKEND_DEVICE = -402,
    MA_FAILED_TO_STOP_BACKEND_DEVICE = -403,
}
pub const MA_MIN_CHANNELS: u32 = 1;
pub const MA_MAX_CHANNELS: u32 = 254;
pub const MA_MAX_FILTER_ORDER: u32 = 8;
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_stream_format {
    ma_stream_format_pcm = 0,
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_stream_layout {
    ma_stream_layout_interleaved = 0,
    ma_stream_layout_deinterleaved = 1,
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_dither_mode {
    ma_dither_mode_none = 0,
    ma_dither_mode_rectangle = 1,
    ma_dither_mode_triangle = 2,
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_format {
    ma_format_unknown = 0,
    ma_format_u8 = 1,
    ma_format_s16 = 2,
    ma_format_s24 = 3,
    ma_format_s32 = 4,
    ma_format_f32 = 5,
    ma_format_count = 6,
}
impl ma_standard_sample_rate {
    pub const ma_standard_sample_rate_min: ma_standard_sample_rate =
        ma_standard_sample_rate::ma_standard_sample_rate_8000;
}
impl ma_standard_sample_rate {
    pub const ma_standard_sample_rate_max: ma_standard_sample_rate =
        ma_standard_sample_rate::ma_standard_sample_rate_384000;
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_standard_sample_rate {
    ma_standard_sample_rate_48000 = 48000,
    ma_standard_sample_rate_44100 = 44100,
    ma_standard_sample_rate_32000 = 32000,
    ma_standard_sample_rate_24000 = 24000,
    ma_standard_sample_rate_22050 = 22050,
    ma_standard_sample_rate_88200 = 88200,
    ma_standard_sample_rate_96000 = 96000,
    ma_standard_sample_rate_176400 = 176400,
    ma_standard_sample_rate_192000 = 192000,
    ma_standard_sample_rate_16000 = 16000,
    ma_standard_sample_rate_11025 = 11250,
    ma_standard_sample_rate_8000 = 8000,
    ma_standard_sample_rate_352800 = 352800,
    ma_standard_sample_rate_384000 = 384000,
    ma_standard_sample_rate_count = 14,
}
impl ma_channel_mix_mode {
    pub const ma_channel_mix_mode_default: ma_channel_mix_mode =
        ma_channel_mix_mode::ma_channel_mix_mode_rectangular;
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_channel_mix_mode {
    ma_channel_mix_mode_rectangular = 0,
    ma_channel_mix_mode_simple = 1,
    ma_channel_mix_mode_custom_weights = 2,
}
impl ma_standard_channel_map {
    pub const ma_standard_channel_map_webaudio: ma_standard_channel_map =
        ma_standard_channel_map::ma_standard_channel_map_flac;
}
impl ma_standard_channel_map {
    pub const ma_standard_channel_map_default: ma_standard_channel_map =
        ma_standard_channel_map::ma_standard_channel_map_microsoft;
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_standard_channel_map {
    ma_standard_channel_map_microsoft = 0,
    ma_standard_channel_map_alsa = 1,
    ma_standard_channel_map_rfc3551 = 2,
    ma_standard_channel_map_flac = 3,
    ma_standard_channel_map_vorbis = 4,
    ma_standard_channel_map_sound4 = 5,
    ma_standard_channel_map_sndio = 6,
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_performance_profile {
    ma_performance_profile_low_latency = 0,
    ma_performance_profile_conservative = 1,
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_allocation_callbacks {
    pub pUserData: *mut ::std::os::raw::c_void,
    pub onMalloc: ::std::option::Option<
        unsafe extern "C" fn(
            sz: usize,
            pUserData: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub onRealloc: ::std::option::Option<
        unsafe extern "C" fn(
            p: *mut ::std::os::raw::c_void,
            sz: usize,
            pUserData: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub onFree: ::std::option::Option<
        unsafe extern "C" fn(
            p: *mut ::std::os::raw::c_void,
            pUserData: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[test]
fn bindgen_test_layout_ma_allocation_callbacks() {
    const UNINIT: ::std::mem::MaybeUninit<ma_allocation_callbacks> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_allocation_callbacks>(),
        32usize,
        concat!("Size of: ", stringify!(ma_allocation_callbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_allocation_callbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_allocation_callbacks))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pUserData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_allocation_callbacks),
            "::",
            stringify!(pUserData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onMalloc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_allocation_callbacks),
            "::",
            stringify!(onMalloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onRealloc) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_allocation_callbacks),
            "::",
            stringify!(onRealloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onFree) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_allocation_callbacks),
            "::",
            stringify!(onFree)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_lcg {
    pub state: ma_int32,
}
#[test]
fn bindgen_test_layout_ma_lcg() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lcg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lcg>(),
        4usize,
        concat!("Size of: ", stringify!(ma_lcg))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lcg>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_lcg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lcg),
            "::",
            stringify!(state)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_atomic_uint32 {
    pub value: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_atomic_uint32() {
    const UNINIT: ::std::mem::MaybeUninit<ma_atomic_uint32> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_atomic_uint32>(),
        4usize,
        concat!("Size of: ", stringify!(ma_atomic_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_atomic_uint32>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_atomic_uint32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_atomic_uint32),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_atomic_int32 {
    pub value: ma_int32,
}
#[test]
fn bindgen_test_layout_ma_atomic_int32() {
    const UNINIT: ::std::mem::MaybeUninit<ma_atomic_int32> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_atomic_int32>(),
        4usize,
        concat!("Size of: ", stringify!(ma_atomic_int32))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_atomic_int32>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_atomic_int32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_atomic_int32),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_atomic_uint64 {
    pub value: ma_uint64,
}
#[test]
fn bindgen_test_layout_ma_atomic_uint64() {
    const UNINIT: ::std::mem::MaybeUninit<ma_atomic_uint64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_atomic_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(ma_atomic_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_atomic_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_atomic_uint64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_atomic_uint64),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_atomic_float {
    pub value: ma_float,
}
#[test]
fn bindgen_test_layout_ma_atomic_float() {
    const UNINIT: ::std::mem::MaybeUninit<ma_atomic_float> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_atomic_float>(),
        4usize,
        concat!("Size of: ", stringify!(ma_atomic_float))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_atomic_float>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_atomic_float))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_atomic_float),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_atomic_bool32 {
    pub value: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_atomic_bool32() {
    const UNINIT: ::std::mem::MaybeUninit<ma_atomic_bool32> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_atomic_bool32>(),
        4usize,
        concat!("Size of: ", stringify!(ma_atomic_bool32))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_atomic_bool32>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_atomic_bool32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_atomic_bool32),
            "::",
            stringify!(value)
        )
    );
}
pub type ma_spinlock = ma_uint32;
impl ma_thread_priority {
    pub const ma_thread_priority_default: ma_thread_priority =
        ma_thread_priority::ma_thread_priority_highest;
}
#[repr(i32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_thread_priority {
    ma_thread_priority_idle = -5,
    ma_thread_priority_lowest = -4,
    ma_thread_priority_low = -3,
    ma_thread_priority_normal = -2,
    ma_thread_priority_high = -1,
    ma_thread_priority_highest = 0,
    ma_thread_priority_realtime = 1,
}
pub type ma_thread = ma_pthread_t;
pub type ma_mutex = ma_pthread_mutex_t;
#[repr(C)]
#[derive(Debug)]
pub struct ma_event {
    pub value: ma_uint32,
    pub lock: ma_pthread_mutex_t,
    pub cond: ma_pthread_cond_t,
}
#[test]
fn bindgen_test_layout_ma_event() {
    const UNINIT: ::std::mem::MaybeUninit<ma_event> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_event>(),
        120usize,
        concat!("Size of: ", stringify!(ma_event))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_event>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_event))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_event),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_event),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cond) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_event),
            "::",
            stringify!(cond)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_semaphore {
    pub value: ::std::os::raw::c_int,
    pub lock: ma_pthread_mutex_t,
    pub cond: ma_pthread_cond_t,
}
#[test]
fn bindgen_test_layout_ma_semaphore() {
    const UNINIT: ::std::mem::MaybeUninit<ma_semaphore> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_semaphore>(),
        120usize,
        concat!("Size of: ", stringify!(ma_semaphore))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_semaphore>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_semaphore))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_semaphore),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_semaphore),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cond) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_semaphore),
            "::",
            stringify!(cond)
        )
    );
}
extern "C" {
    pub fn ma_version(pMajor: *mut ma_uint32, pMinor: *mut ma_uint32, pRevision: *mut ma_uint32);
}
extern "C" {
    pub fn ma_version_string() -> *const ::std::os::raw::c_char;
}
pub type va_list = __builtin_va_list;
pub const __GNUC_VA_LIST: u32 = 1;
pub type __gnuc_va_list = __builtin_va_list;
pub const MA_MAX_LOG_CALLBACKS: u32 = 4;
pub type ma_log_callback_proc = ::std::option::Option<
    unsafe extern "C" fn(
        pUserData: *mut ::std::os::raw::c_void,
        level: ma_uint32,
        pMessage: *const ::std::os::raw::c_char,
    ),
>;
#[repr(C)]
#[derive(Debug)]
pub struct ma_log_callback {
    pub onLog: ma_log_callback_proc,
    pub pUserData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_log_callback() {
    const UNINIT: ::std::mem::MaybeUninit<ma_log_callback> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_log_callback>(),
        16usize,
        concat!("Size of: ", stringify!(ma_log_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_log_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_log_callback))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onLog) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_log_callback),
            "::",
            stringify!(onLog)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pUserData) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_log_callback),
            "::",
            stringify!(pUserData)
        )
    );
}
extern "C" {
    pub fn ma_log_callback_init(
        onLog: ma_log_callback_proc,
        pUserData: *mut ::std::os::raw::c_void,
    ) -> ma_log_callback;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_log {
    pub callbacks: [ma_log_callback; 4usize],
    pub callbackCount: ma_uint32,
    pub allocationCallbacks: ma_allocation_callbacks,
    pub lock: ma_mutex,
}
#[test]
fn bindgen_test_layout_ma_log() {
    const UNINIT: ::std::mem::MaybeUninit<ma_log> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_log>(),
        168usize,
        concat!("Size of: ", stringify!(ma_log))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_log>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_log))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callbacks) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_log),
            "::",
            stringify!(callbacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callbackCount) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_log),
            "::",
            stringify!(callbackCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocationCallbacks) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_log),
            "::",
            stringify!(allocationCallbacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_log),
            "::",
            stringify!(lock)
        )
    );
}
extern "C" {
    pub fn ma_log_init(
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pLog: *mut ma_log,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_log_uninit(pLog: *mut ma_log);
}
extern "C" {
    pub fn ma_log_register_callback(pLog: *mut ma_log, callback: ma_log_callback) -> ma_result;
}
extern "C" {
    pub fn ma_log_unregister_callback(pLog: *mut ma_log, callback: ma_log_callback) -> ma_result;
}
extern "C" {
    pub fn ma_log_post(
        pLog: *mut ma_log,
        level: ma_uint32,
        pMessage: *const ::std::os::raw::c_char,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_log_postv(
        pLog: *mut ma_log,
        level: ma_uint32,
        pFormat: *const ::std::os::raw::c_char,
        args: va_list,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_log_postf(
        pLog: *mut ma_log,
        level: ma_uint32,
        pFormat: *const ::std::os::raw::c_char,
        ...
    ) -> ma_result;
}
#[doc = "Biquad Filtering"]
#[repr(C)]
pub struct ma_biquad_coefficient {
    pub f32_: __BindgenUnionField<f32>,
    pub s32: __BindgenUnionField<ma_int32>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_ma_biquad_coefficient() {
    const UNINIT: ::std::mem::MaybeUninit<ma_biquad_coefficient> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_biquad_coefficient>(),
        4usize,
        concat!("Size of: ", stringify!(ma_biquad_coefficient))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_biquad_coefficient>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_biquad_coefficient))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_coefficient),
            "::",
            stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_coefficient),
            "::",
            stringify!(s32)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_biquad_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub b0: f64,
    pub b1: f64,
    pub b2: f64,
    pub a0: f64,
    pub a1: f64,
    pub a2: f64,
}
#[test]
fn bindgen_test_layout_ma_biquad_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_biquad_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_biquad_config>(),
        56usize,
        concat!("Size of: ", stringify!(ma_biquad_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_biquad_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_biquad_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b0) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(b0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(b1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(b2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a0) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(a0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(a2)
        )
    );
}
extern "C" {
    pub fn ma_biquad_config_init(
        format: ma_format,
        channels: ma_uint32,
        b0: f64,
        b1: f64,
        b2: f64,
        a0: f64,
        a1: f64,
        a2: f64,
    ) -> ma_biquad_config;
}
#[repr(C)]
pub struct ma_biquad {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub b0: ma_biquad_coefficient,
    pub b1: ma_biquad_coefficient,
    pub b2: ma_biquad_coefficient,
    pub a1: ma_biquad_coefficient,
    pub a2: ma_biquad_coefficient,
    pub pR1: *mut ma_biquad_coefficient,
    pub pR2: *mut ma_biquad_coefficient,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_biquad() {
    const UNINIT: ::std::mem::MaybeUninit<ma_biquad> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_biquad>(),
        64usize,
        concat!("Size of: ", stringify!(ma_biquad))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_biquad>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_biquad))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b0) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(b0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b1) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(b1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(b2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a1) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(a2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pR1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(pR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pR2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(pR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_biquad_get_heap_size(
        pConfig: *const ma_biquad_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_init_preallocated(
        pConfig: *const ma_biquad_config,
        pHeap: *mut ::std::os::raw::c_void,
        pBQ: *mut ma_biquad,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_init(
        pConfig: *const ma_biquad_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pBQ: *mut ma_biquad,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_uninit(
        pBQ: *mut ma_biquad,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_biquad_reinit(pConfig: *const ma_biquad_config, pBQ: *mut ma_biquad) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_clear_cache(pBQ: *mut ma_biquad) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_process_pcm_frames(
        pBQ: *mut ma_biquad,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_get_latency(pBQ: *const ma_biquad) -> ma_uint32;
}
#[doc = "Low-Pass Filtering"]
#[repr(C)]
#[derive(Debug)]
pub struct ma_lpf1_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_lpf1_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lpf1_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lpf1_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_lpf1_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf1_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf1_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1_config),
            "::",
            stringify!(q)
        )
    );
}
#[doc = "Low-Pass Filtering"]
pub type ma_lpf2_config = ma_lpf1_config;
extern "C" {
    pub fn ma_lpf1_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
    ) -> ma_lpf1_config;
}
extern "C" {
    pub fn ma_lpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_lpf2_config;
}
#[repr(C)]
pub struct ma_lpf1 {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub a: ma_biquad_coefficient,
    pub pR1: *mut ma_biquad_coefficient,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_lpf1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lpf1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lpf1>(),
        40usize,
        concat!("Size of: ", stringify!(ma_lpf1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pR1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1),
            "::",
            stringify!(pR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_lpf1_get_heap_size(
        pConfig: *const ma_lpf1_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_init_preallocated(
        pConfig: *const ma_lpf1_config,
        pHeap: *mut ::std::os::raw::c_void,
        pLPF: *mut ma_lpf1,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_init(
        pConfig: *const ma_lpf1_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pLPF: *mut ma_lpf1,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_uninit(pLPF: *mut ma_lpf1, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_lpf1_reinit(pConfig: *const ma_lpf1_config, pLPF: *mut ma_lpf1) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_clear_cache(pLPF: *mut ma_lpf1) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_process_pcm_frames(
        pLPF: *mut ma_lpf1,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_get_latency(pLPF: *const ma_lpf1) -> ma_uint32;
}
#[repr(C)]
pub struct ma_lpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_lpf2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lpf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lpf2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_lpf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf2),
            "::",
            stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_lpf2_get_heap_size(
        pConfig: *const ma_lpf2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_init_preallocated(
        pConfig: *const ma_lpf2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pHPF: *mut ma_lpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_init(
        pConfig: *const ma_lpf2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pLPF: *mut ma_lpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_uninit(pLPF: *mut ma_lpf2, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_lpf2_reinit(pConfig: *const ma_lpf2_config, pLPF: *mut ma_lpf2) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_clear_cache(pLPF: *mut ma_lpf2) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_process_pcm_frames(
        pLPF: *mut ma_lpf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_get_latency(pLPF: *const ma_lpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_lpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_lpf_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lpf_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_lpf_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf_config),
            "::",
            stringify!(order)
        )
    );
}
extern "C" {
    pub fn ma_lpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_lpf_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_lpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub lpf1Count: ma_uint32,
    pub lpf2Count: ma_uint32,
    pub pLPF1: *mut ma_lpf1,
    pub pLPF2: *mut ma_lpf2,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_lpf() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lpf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lpf>(),
        56usize,
        concat!("Size of: ", stringify!(ma_lpf))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpf1Count) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(lpf1Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpf2Count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(lpf2Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pLPF1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(pLPF1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pLPF2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(pLPF2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_lpf_get_heap_size(
        pConfig: *const ma_lpf_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_init_preallocated(
        pConfig: *const ma_lpf_config,
        pHeap: *mut ::std::os::raw::c_void,
        pLPF: *mut ma_lpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_init(
        pConfig: *const ma_lpf_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pLPF: *mut ma_lpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_uninit(pLPF: *mut ma_lpf, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_lpf_reinit(pConfig: *const ma_lpf_config, pLPF: *mut ma_lpf) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_clear_cache(pLPF: *mut ma_lpf) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_process_pcm_frames(
        pLPF: *mut ma_lpf,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_get_latency(pLPF: *const ma_lpf) -> ma_uint32;
}
#[doc = "High-Pass Filtering"]
#[repr(C)]
#[derive(Debug)]
pub struct ma_hpf1_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_hpf1_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hpf1_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hpf1_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_hpf1_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf1_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf1_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1_config),
            "::",
            stringify!(q)
        )
    );
}
#[doc = "High-Pass Filtering"]
pub type ma_hpf2_config = ma_hpf1_config;
extern "C" {
    pub fn ma_hpf1_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
    ) -> ma_hpf1_config;
}
extern "C" {
    pub fn ma_hpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_hpf2_config;
}
#[repr(C)]
pub struct ma_hpf1 {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub a: ma_biquad_coefficient,
    pub pR1: *mut ma_biquad_coefficient,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_hpf1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hpf1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hpf1>(),
        40usize,
        concat!("Size of: ", stringify!(ma_hpf1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pR1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1),
            "::",
            stringify!(pR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_hpf1_get_heap_size(
        pConfig: *const ma_hpf1_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_init_preallocated(
        pConfig: *const ma_hpf1_config,
        pHeap: *mut ::std::os::raw::c_void,
        pLPF: *mut ma_hpf1,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_init(
        pConfig: *const ma_hpf1_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pHPF: *mut ma_hpf1,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_uninit(pHPF: *mut ma_hpf1, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_hpf1_reinit(pConfig: *const ma_hpf1_config, pHPF: *mut ma_hpf1) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_process_pcm_frames(
        pHPF: *mut ma_hpf1,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_get_latency(pHPF: *const ma_hpf1) -> ma_uint32;
}
#[repr(C)]
pub struct ma_hpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_hpf2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hpf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hpf2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_hpf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf2),
            "::",
            stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_hpf2_get_heap_size(
        pConfig: *const ma_hpf2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_init_preallocated(
        pConfig: *const ma_hpf2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pHPF: *mut ma_hpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_init(
        pConfig: *const ma_hpf2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pHPF: *mut ma_hpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_uninit(pHPF: *mut ma_hpf2, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_hpf2_reinit(pConfig: *const ma_hpf2_config, pHPF: *mut ma_hpf2) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_process_pcm_frames(
        pHPF: *mut ma_hpf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_get_latency(pHPF: *const ma_hpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_hpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_hpf_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hpf_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_hpf_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf_config),
            "::",
            stringify!(order)
        )
    );
}
extern "C" {
    pub fn ma_hpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_hpf_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_hpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub hpf1Count: ma_uint32,
    pub hpf2Count: ma_uint32,
    pub pHPF1: *mut ma_hpf1,
    pub pHPF2: *mut ma_hpf2,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_hpf() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hpf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hpf>(),
        56usize,
        concat!("Size of: ", stringify!(ma_hpf))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hpf1Count) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(hpf1Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hpf2Count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(hpf2Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pHPF1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(pHPF1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pHPF2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(pHPF2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_hpf_get_heap_size(
        pConfig: *const ma_hpf_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_init_preallocated(
        pConfig: *const ma_hpf_config,
        pHeap: *mut ::std::os::raw::c_void,
        pLPF: *mut ma_hpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_init(
        pConfig: *const ma_hpf_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pHPF: *mut ma_hpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_uninit(pHPF: *mut ma_hpf, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_hpf_reinit(pConfig: *const ma_hpf_config, pHPF: *mut ma_hpf) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_process_pcm_frames(
        pHPF: *mut ma_hpf,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_get_latency(pHPF: *const ma_hpf) -> ma_uint32;
}
#[doc = "Band-Pass Filtering"]
#[repr(C)]
#[derive(Debug)]
pub struct ma_bpf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_bpf2_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_bpf2_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_bpf2_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_bpf2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf2_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2_config),
            "::",
            stringify!(q)
        )
    );
}
extern "C" {
    pub fn ma_bpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_bpf2_config;
}
#[repr(C)]
pub struct ma_bpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_bpf2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_bpf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_bpf2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_bpf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2),
            "::",
            stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_bpf2_get_heap_size(
        pConfig: *const ma_bpf2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_init_preallocated(
        pConfig: *const ma_bpf2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pBPF: *mut ma_bpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_init(
        pConfig: *const ma_bpf2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pBPF: *mut ma_bpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_uninit(pBPF: *mut ma_bpf2, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_bpf2_reinit(pConfig: *const ma_bpf2_config, pBPF: *mut ma_bpf2) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_process_pcm_frames(
        pBPF: *mut ma_bpf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_get_latency(pBPF: *const ma_bpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_bpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_bpf_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_bpf_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_bpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_bpf_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf_config),
            "::",
            stringify!(order)
        )
    );
}
extern "C" {
    pub fn ma_bpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_bpf_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_bpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub bpf2Count: ma_uint32,
    pub pBPF2: *mut ma_bpf2,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_bpf() {
    const UNINIT: ::std::mem::MaybeUninit<ma_bpf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_bpf>(),
        40usize,
        concat!("Size of: ", stringify!(ma_bpf))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bpf2Count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf),
            "::",
            stringify!(bpf2Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBPF2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf),
            "::",
            stringify!(pBPF2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_bpf_get_heap_size(
        pConfig: *const ma_bpf_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_init_preallocated(
        pConfig: *const ma_bpf_config,
        pHeap: *mut ::std::os::raw::c_void,
        pBPF: *mut ma_bpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_init(
        pConfig: *const ma_bpf_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pBPF: *mut ma_bpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_uninit(pBPF: *mut ma_bpf, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_bpf_reinit(pConfig: *const ma_bpf_config, pBPF: *mut ma_bpf) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_process_pcm_frames(
        pBPF: *mut ma_bpf,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_get_latency(pBPF: *const ma_bpf) -> ma_uint32;
}
#[doc = "Notching Filter"]
#[repr(C)]
#[derive(Debug)]
pub struct ma_notch2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub q: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_notch2_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_notch2_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_notch2_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_notch2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_notch2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_notch2_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2_config),
            "::",
            stringify!(q)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2_config),
            "::",
            stringify!(frequency)
        )
    );
}
#[doc = "Notching Filter"]
pub type ma_notch_config = ma_notch2_config;
extern "C" {
    pub fn ma_notch2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        q: f64,
        frequency: f64,
    ) -> ma_notch2_config;
}
#[repr(C)]
pub struct ma_notch2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_notch2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_notch2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_notch2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_notch2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_notch2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_notch2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2),
            "::",
            stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_notch2_get_heap_size(
        pConfig: *const ma_notch2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_init_preallocated(
        pConfig: *const ma_notch2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pFilter: *mut ma_notch2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_init(
        pConfig: *const ma_notch2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pFilter: *mut ma_notch2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_uninit(
        pFilter: *mut ma_notch2,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_notch2_reinit(pConfig: *const ma_notch2_config, pFilter: *mut ma_notch2)
        -> ma_result;
}
extern "C" {
    pub fn ma_notch2_process_pcm_frames(
        pFilter: *mut ma_notch2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_get_latency(pFilter: *const ma_notch2) -> ma_uint32;
}
#[doc = "Peaking EQ Filter"]
#[repr(C)]
#[derive(Debug)]
pub struct ma_peak2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub q: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_peak2_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_peak2_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_peak2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_peak2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_peak2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_peak2_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainDB) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(gainDB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(q)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(frequency)
        )
    );
}
#[doc = "Peaking EQ Filter"]
pub type ma_peak_config = ma_peak2_config;
extern "C" {
    pub fn ma_peak2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        q: f64,
        frequency: f64,
    ) -> ma_peak2_config;
}
#[repr(C)]
pub struct ma_peak2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_peak2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_peak2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_peak2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_peak2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_peak2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_peak2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2),
            "::",
            stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_peak2_get_heap_size(
        pConfig: *const ma_peak2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_init_preallocated(
        pConfig: *const ma_peak2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pFilter: *mut ma_peak2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_init(
        pConfig: *const ma_peak2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pFilter: *mut ma_peak2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_uninit(
        pFilter: *mut ma_peak2,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_peak2_reinit(pConfig: *const ma_peak2_config, pFilter: *mut ma_peak2) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_process_pcm_frames(
        pFilter: *mut ma_peak2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_get_latency(pFilter: *const ma_peak2) -> ma_uint32;
}
#[doc = "Low Shelf Filter"]
#[repr(C)]
#[derive(Debug)]
pub struct ma_loshelf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub shelfSlope: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_loshelf2_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_loshelf2_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_loshelf2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_loshelf2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_loshelf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_loshelf2_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainDB) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(gainDB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shelfSlope) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(shelfSlope)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(frequency)
        )
    );
}
#[doc = "Low Shelf Filter"]
pub type ma_loshelf_config = ma_loshelf2_config;
extern "C" {
    pub fn ma_loshelf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        shelfSlope: f64,
        frequency: f64,
    ) -> ma_loshelf2_config;
}
#[repr(C)]
pub struct ma_loshelf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_loshelf2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_loshelf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_loshelf2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_loshelf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_loshelf2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_loshelf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2),
            "::",
            stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_loshelf2_get_heap_size(
        pConfig: *const ma_loshelf2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_init_preallocated(
        pConfig: *const ma_loshelf2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pFilter: *mut ma_loshelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_init(
        pConfig: *const ma_loshelf2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pFilter: *mut ma_loshelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_uninit(
        pFilter: *mut ma_loshelf2,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_loshelf2_reinit(
        pConfig: *const ma_loshelf2_config,
        pFilter: *mut ma_loshelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_process_pcm_frames(
        pFilter: *mut ma_loshelf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_get_latency(pFilter: *const ma_loshelf2) -> ma_uint32;
}
#[doc = "High Shelf Filter"]
#[repr(C)]
#[derive(Debug)]
pub struct ma_hishelf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub shelfSlope: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_hishelf2_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hishelf2_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hishelf2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_hishelf2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hishelf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hishelf2_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainDB) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(gainDB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shelfSlope) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(shelfSlope)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(frequency)
        )
    );
}
#[doc = "High Shelf Filter"]
pub type ma_hishelf_config = ma_hishelf2_config;
extern "C" {
    pub fn ma_hishelf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        shelfSlope: f64,
        frequency: f64,
    ) -> ma_hishelf2_config;
}
#[repr(C)]
pub struct ma_hishelf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_hishelf2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hishelf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hishelf2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_hishelf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hishelf2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hishelf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2),
            "::",
            stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_hishelf2_get_heap_size(
        pConfig: *const ma_hishelf2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_init_preallocated(
        pConfig: *const ma_hishelf2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pFilter: *mut ma_hishelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_init(
        pConfig: *const ma_hishelf2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pFilter: *mut ma_hishelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_uninit(
        pFilter: *mut ma_hishelf2,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_hishelf2_reinit(
        pConfig: *const ma_hishelf2_config,
        pFilter: *mut ma_hishelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_process_pcm_frames(
        pFilter: *mut ma_hishelf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_get_latency(pFilter: *const ma_hishelf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_delay_config {
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub delayInFrames: ma_uint32,
    pub delayStart: ma_bool32,
    pub wet: f32,
    pub dry: f32,
    pub decay: f32,
}
#[test]
fn bindgen_test_layout_ma_delay_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_delay_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_delay_config>(),
        28usize,
        concat!("Size of: ", stringify!(ma_delay_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_delay_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_delay_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delayInFrames) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay_config),
            "::",
            stringify!(delayInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delayStart) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay_config),
            "::",
            stringify!(delayStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wet) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay_config),
            "::",
            stringify!(wet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dry) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay_config),
            "::",
            stringify!(dry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decay) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay_config),
            "::",
            stringify!(decay)
        )
    );
}
extern "C" {
    pub fn ma_delay_config_init(
        channels: ma_uint32,
        sampleRate: ma_uint32,
        delayInFrames: ma_uint32,
        decay: f32,
    ) -> ma_delay_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_delay {
    pub config: ma_delay_config,
    pub cursor: ma_uint32,
    pub bufferSizeInFrames: ma_uint32,
    pub pBuffer: *mut f32,
}
#[test]
fn bindgen_test_layout_ma_delay() {
    const UNINIT: ::std::mem::MaybeUninit<ma_delay> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_delay>(),
        48usize,
        concat!("Size of: ", stringify!(ma_delay))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_delay>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_delay))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cursor) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay),
            "::",
            stringify!(cursor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bufferSizeInFrames) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay),
            "::",
            stringify!(bufferSizeInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBuffer) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_delay),
            "::",
            stringify!(pBuffer)
        )
    );
}
extern "C" {
    pub fn ma_delay_init(
        pConfig: *const ma_delay_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pDelay: *mut ma_delay,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_delay_uninit(
        pDelay: *mut ma_delay,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_delay_process_pcm_frames(
        pDelay: *mut ma_delay,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_delay_set_wet(pDelay: *mut ma_delay, value: f32);
}
extern "C" {
    pub fn ma_delay_get_wet(pDelay: *const ma_delay) -> f32;
}
extern "C" {
    pub fn ma_delay_set_dry(pDelay: *mut ma_delay, value: f32);
}
extern "C" {
    pub fn ma_delay_get_dry(pDelay: *const ma_delay) -> f32;
}
extern "C" {
    pub fn ma_delay_set_decay(pDelay: *mut ma_delay, value: f32);
}
extern "C" {
    pub fn ma_delay_get_decay(pDelay: *const ma_delay) -> f32;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_gainer_config {
    pub channels: ma_uint32,
    pub smoothTimeInFrames: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_gainer_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_gainer_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_gainer_config>(),
        8usize,
        concat!("Size of: ", stringify!(ma_gainer_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_gainer_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_gainer_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_gainer_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).smoothTimeInFrames) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_gainer_config),
            "::",
            stringify!(smoothTimeInFrames)
        )
    );
}
extern "C" {
    pub fn ma_gainer_config_init(
        channels: ma_uint32,
        smoothTimeInFrames: ma_uint32,
    ) -> ma_gainer_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_gainer {
    pub config: ma_gainer_config,
    pub t: ma_uint32,
    pub masterVolume: f32,
    pub pOldGains: *mut f32,
    pub pNewGains: *mut f32,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_gainer() {
    const UNINIT: ::std::mem::MaybeUninit<ma_gainer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_gainer>(),
        48usize,
        concat!("Size of: ", stringify!(ma_gainer))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_gainer>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_gainer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_gainer),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_gainer),
            "::",
            stringify!(t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).masterVolume) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_gainer),
            "::",
            stringify!(masterVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pOldGains) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_gainer),
            "::",
            stringify!(pOldGains)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pNewGains) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_gainer),
            "::",
            stringify!(pNewGains)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_gainer),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_gainer),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_gainer_get_heap_size(
        pConfig: *const ma_gainer_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_init_preallocated(
        pConfig: *const ma_gainer_config,
        pHeap: *mut ::std::os::raw::c_void,
        pGainer: *mut ma_gainer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_init(
        pConfig: *const ma_gainer_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pGainer: *mut ma_gainer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_uninit(
        pGainer: *mut ma_gainer,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_gainer_process_pcm_frames(
        pGainer: *mut ma_gainer,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_set_gain(pGainer: *mut ma_gainer, newGain: f32) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_set_gains(pGainer: *mut ma_gainer, pNewGains: *mut f32) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_set_master_volume(pGainer: *mut ma_gainer, volume: f32) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_get_master_volume(pGainer: *const ma_gainer, pVolume: *mut f32) -> ma_result;
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_pan_mode {
    ma_pan_mode_balance = 0,
    ma_pan_mode_pan = 1,
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_panner_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub mode: ma_pan_mode,
    pub pan: f32,
}
#[test]
fn bindgen_test_layout_ma_panner_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_panner_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_panner_config>(),
        16usize,
        concat!("Size of: ", stringify!(ma_panner_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_panner_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_panner_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_panner_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_panner_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_panner_config),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pan) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_panner_config),
            "::",
            stringify!(pan)
        )
    );
}
extern "C" {
    pub fn ma_panner_config_init(format: ma_format, channels: ma_uint32) -> ma_panner_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_panner {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub mode: ma_pan_mode,
    pub pan: f32,
}
#[test]
fn bindgen_test_layout_ma_panner() {
    const UNINIT: ::std::mem::MaybeUninit<ma_panner> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_panner>(),
        16usize,
        concat!("Size of: ", stringify!(ma_panner))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_panner>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_panner))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_panner),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_panner),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_panner),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pan) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_panner),
            "::",
            stringify!(pan)
        )
    );
}
extern "C" {
    pub fn ma_panner_init(pConfig: *const ma_panner_config, pPanner: *mut ma_panner) -> ma_result;
}
extern "C" {
    pub fn ma_panner_process_pcm_frames(
        pPanner: *mut ma_panner,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_panner_set_mode(pPanner: *mut ma_panner, mode: ma_pan_mode);
}
extern "C" {
    pub fn ma_panner_get_mode(pPanner: *const ma_panner) -> ma_pan_mode;
}
extern "C" {
    pub fn ma_panner_set_pan(pPanner: *mut ma_panner, pan: f32);
}
extern "C" {
    pub fn ma_panner_get_pan(pPanner: *const ma_panner) -> f32;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_fader_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_fader_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_fader_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_fader_config>(),
        12usize,
        concat!("Size of: ", stringify!(ma_fader_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_fader_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_fader_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_fader_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_fader_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_fader_config),
            "::",
            stringify!(sampleRate)
        )
    );
}
extern "C" {
    pub fn ma_fader_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
    ) -> ma_fader_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_fader {
    pub config: ma_fader_config,
    pub volumeBeg: f32,
    pub volumeEnd: f32,
    pub lengthInFrames: ma_uint64,
    pub cursorInFrames: ma_uint64,
}
#[test]
fn bindgen_test_layout_ma_fader() {
    const UNINIT: ::std::mem::MaybeUninit<ma_fader> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_fader>(),
        40usize,
        concat!("Size of: ", stringify!(ma_fader))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_fader>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_fader))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_fader),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).volumeBeg) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_fader),
            "::",
            stringify!(volumeBeg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).volumeEnd) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_fader),
            "::",
            stringify!(volumeEnd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lengthInFrames) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_fader),
            "::",
            stringify!(lengthInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cursorInFrames) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_fader),
            "::",
            stringify!(cursorInFrames)
        )
    );
}
extern "C" {
    pub fn ma_fader_init(pConfig: *const ma_fader_config, pFader: *mut ma_fader) -> ma_result;
}
extern "C" {
    pub fn ma_fader_process_pcm_frames(
        pFader: *mut ma_fader,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_fader_get_data_format(
        pFader: *const ma_fader,
        pFormat: *mut ma_format,
        pChannels: *mut ma_uint32,
        pSampleRate: *mut ma_uint32,
    );
}
extern "C" {
    pub fn ma_fader_set_fade(
        pFader: *mut ma_fader,
        volumeBeg: f32,
        volumeEnd: f32,
        lengthInFrames: ma_uint64,
    );
}
extern "C" {
    pub fn ma_fader_get_current_volume(pFader: *const ma_fader) -> f32;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_vec3f {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[test]
fn bindgen_test_layout_ma_vec3f() {
    const UNINIT: ::std::mem::MaybeUninit<ma_vec3f> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_vec3f>(),
        12usize,
        concat!("Size of: ", stringify!(ma_vec3f))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_vec3f>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_vec3f))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_vec3f),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_vec3f),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_vec3f),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_atomic_vec3f {
    pub v: ma_vec3f,
    pub lock: ma_spinlock,
}
#[test]
fn bindgen_test_layout_ma_atomic_vec3f() {
    const UNINIT: ::std::mem::MaybeUninit<ma_atomic_vec3f> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_atomic_vec3f>(),
        16usize,
        concat!("Size of: ", stringify!(ma_atomic_vec3f))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_atomic_vec3f>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_atomic_vec3f))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_atomic_vec3f),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_atomic_vec3f),
            "::",
            stringify!(lock)
        )
    );
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_attenuation_model {
    ma_attenuation_model_none = 0,
    ma_attenuation_model_inverse = 1,
    ma_attenuation_model_linear = 2,
    ma_attenuation_model_exponential = 3,
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_positioning {
    ma_positioning_absolute = 0,
    ma_positioning_relative = 1,
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_handedness {
    ma_handedness_right = 0,
    ma_handedness_left = 1,
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_spatializer_listener_config {
    pub channelsOut: ma_uint32,
    pub pChannelMapOut: *mut ma_channel,
    pub handedness: ma_handedness,
    pub coneInnerAngleInRadians: f32,
    pub coneOuterAngleInRadians: f32,
    pub coneOuterGain: f32,
    pub speedOfSound: f32,
    pub worldUp: ma_vec3f,
}
#[test]
fn bindgen_test_layout_ma_spatializer_listener_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_spatializer_listener_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_spatializer_listener_config>(),
        48usize,
        concat!("Size of: ", stringify!(ma_spatializer_listener_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_spatializer_listener_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_spatializer_listener_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener_config),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapOut) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener_config),
            "::",
            stringify!(pChannelMapOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handedness) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener_config),
            "::",
            stringify!(handedness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneInnerAngleInRadians) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener_config),
            "::",
            stringify!(coneInnerAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterAngleInRadians) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener_config),
            "::",
            stringify!(coneOuterAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterGain) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener_config),
            "::",
            stringify!(coneOuterGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speedOfSound) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener_config),
            "::",
            stringify!(speedOfSound)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).worldUp) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener_config),
            "::",
            stringify!(worldUp)
        )
    );
}
extern "C" {
    pub fn ma_spatializer_listener_config_init(
        channelsOut: ma_uint32,
    ) -> ma_spatializer_listener_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_spatializer_listener {
    pub config: ma_spatializer_listener_config,
    pub position: ma_atomic_vec3f,
    pub direction: ma_atomic_vec3f,
    pub velocity: ma_atomic_vec3f,
    pub isEnabled: ma_bool32,
    pub _ownsHeap: ma_bool32,
    pub _pHeap: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_spatializer_listener() {
    const UNINIT: ::std::mem::MaybeUninit<ma_spatializer_listener> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_spatializer_listener>(),
        112usize,
        concat!("Size of: ", stringify!(ma_spatializer_listener))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_spatializer_listener>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_spatializer_listener))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener),
            "::",
            stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).velocity) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener),
            "::",
            stringify!(velocity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isEnabled) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener),
            "::",
            stringify!(isEnabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener),
            "::",
            stringify!(_ownsHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_listener),
            "::",
            stringify!(_pHeap)
        )
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_heap_size(
        pConfig: *const ma_spatializer_listener_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_listener_init_preallocated(
        pConfig: *const ma_spatializer_listener_config,
        pHeap: *mut ::std::os::raw::c_void,
        pListener: *mut ma_spatializer_listener,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_listener_init(
        pConfig: *const ma_spatializer_listener_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pListener: *mut ma_spatializer_listener,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_listener_uninit(
        pListener: *mut ma_spatializer_listener,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_channel_map(
        pListener: *mut ma_spatializer_listener,
    ) -> *mut ma_channel;
}
extern "C" {
    pub fn ma_spatializer_listener_set_cone(
        pListener: *mut ma_spatializer_listener,
        innerAngleInRadians: f32,
        outerAngleInRadians: f32,
        outerGain: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_cone(
        pListener: *const ma_spatializer_listener,
        pInnerAngleInRadians: *mut f32,
        pOuterAngleInRadians: *mut f32,
        pOuterGain: *mut f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_set_position(
        pListener: *mut ma_spatializer_listener,
        x: f32,
        y: f32,
        z: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_position(
        pListener: *const ma_spatializer_listener,
    ) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_listener_set_direction(
        pListener: *mut ma_spatializer_listener,
        x: f32,
        y: f32,
        z: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_direction(
        pListener: *const ma_spatializer_listener,
    ) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_listener_set_velocity(
        pListener: *mut ma_spatializer_listener,
        x: f32,
        y: f32,
        z: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_velocity(
        pListener: *const ma_spatializer_listener,
    ) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_listener_set_speed_of_sound(
        pListener: *mut ma_spatializer_listener,
        speedOfSound: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_speed_of_sound(
        pListener: *const ma_spatializer_listener,
    ) -> f32;
}
extern "C" {
    pub fn ma_spatializer_listener_set_world_up(
        pListener: *mut ma_spatializer_listener,
        x: f32,
        y: f32,
        z: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_world_up(
        pListener: *const ma_spatializer_listener,
    ) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_listener_set_enabled(
        pListener: *mut ma_spatializer_listener,
        isEnabled: ma_bool32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_is_enabled(
        pListener: *const ma_spatializer_listener,
    ) -> ma_bool32;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_spatializer_config {
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub pChannelMapIn: *mut ma_channel,
    pub attenuationModel: ma_attenuation_model,
    pub positioning: ma_positioning,
    pub handedness: ma_handedness,
    pub minGain: f32,
    pub maxGain: f32,
    pub minDistance: f32,
    pub maxDistance: f32,
    pub rolloff: f32,
    pub coneInnerAngleInRadians: f32,
    pub coneOuterAngleInRadians: f32,
    pub coneOuterGain: f32,
    pub dopplerFactor: f32,
    pub directionalAttenuationFactor: f32,
    pub minSpatializationChannelGain: f32,
    pub gainSmoothTimeInFrames: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_spatializer_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_spatializer_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_spatializer_config>(),
        80usize,
        concat!("Size of: ", stringify!(ma_spatializer_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_spatializer_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_spatializer_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapIn) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(pChannelMapIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attenuationModel) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(attenuationModel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).positioning) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(positioning)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handedness) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(handedness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minGain) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(minGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxGain) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(maxGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minDistance) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(minDistance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxDistance) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(maxDistance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rolloff) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(rolloff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneInnerAngleInRadians) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(coneInnerAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterAngleInRadians) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(coneOuterAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterGain) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(coneOuterGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dopplerFactor) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(dopplerFactor)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).directionalAttenuationFactor) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(directionalAttenuationFactor)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).minSpatializationChannelGain) as usize - ptr as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(minSpatializationChannelGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainSmoothTimeInFrames) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer_config),
            "::",
            stringify!(gainSmoothTimeInFrames)
        )
    );
}
extern "C" {
    pub fn ma_spatializer_config_init(
        channelsIn: ma_uint32,
        channelsOut: ma_uint32,
    ) -> ma_spatializer_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_spatializer {
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub pChannelMapIn: *mut ma_channel,
    pub attenuationModel: ma_attenuation_model,
    pub positioning: ma_positioning,
    pub handedness: ma_handedness,
    pub minGain: f32,
    pub maxGain: f32,
    pub minDistance: f32,
    pub maxDistance: f32,
    pub rolloff: f32,
    pub coneInnerAngleInRadians: f32,
    pub coneOuterAngleInRadians: f32,
    pub coneOuterGain: f32,
    pub dopplerFactor: f32,
    pub directionalAttenuationFactor: f32,
    pub gainSmoothTimeInFrames: ma_uint32,
    pub position: ma_atomic_vec3f,
    pub direction: ma_atomic_vec3f,
    pub velocity: ma_atomic_vec3f,
    pub dopplerPitch: f32,
    pub minSpatializationChannelGain: f32,
    pub gainer: ma_gainer,
    pub pNewChannelGainsOut: *mut f32,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_spatializer() {
    const UNINIT: ::std::mem::MaybeUninit<ma_spatializer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_spatializer>(),
        200usize,
        concat!("Size of: ", stringify!(ma_spatializer))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_spatializer>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_spatializer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapIn) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(pChannelMapIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attenuationModel) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(attenuationModel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).positioning) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(positioning)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handedness) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(handedness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minGain) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(minGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxGain) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(maxGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minDistance) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(minDistance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxDistance) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(maxDistance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rolloff) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(rolloff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneInnerAngleInRadians) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(coneInnerAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterAngleInRadians) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(coneOuterAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterGain) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(coneOuterGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dopplerFactor) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(dopplerFactor)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).directionalAttenuationFactor) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(directionalAttenuationFactor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainSmoothTimeInFrames) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(gainSmoothTimeInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).velocity) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(velocity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dopplerPitch) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(dopplerPitch)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).minSpatializationChannelGain) as usize - ptr as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(minSpatializationChannelGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainer) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(gainer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pNewChannelGainsOut) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(pNewChannelGainsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_spatializer),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_spatializer_get_heap_size(
        pConfig: *const ma_spatializer_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_init_preallocated(
        pConfig: *const ma_spatializer_config,
        pHeap: *mut ::std::os::raw::c_void,
        pSpatializer: *mut ma_spatializer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_init(
        pConfig: *const ma_spatializer_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pSpatializer: *mut ma_spatializer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_uninit(
        pSpatializer: *mut ma_spatializer,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_spatializer_process_pcm_frames(
        pSpatializer: *mut ma_spatializer,
        pListener: *mut ma_spatializer_listener,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_set_master_volume(
        pSpatializer: *mut ma_spatializer,
        volume: f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_get_master_volume(
        pSpatializer: *const ma_spatializer,
        pVolume: *mut f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_get_input_channels(pSpatializer: *const ma_spatializer) -> ma_uint32;
}
extern "C" {
    pub fn ma_spatializer_get_output_channels(pSpatializer: *const ma_spatializer) -> ma_uint32;
}
extern "C" {
    pub fn ma_spatializer_set_attenuation_model(
        pSpatializer: *mut ma_spatializer,
        attenuationModel: ma_attenuation_model,
    );
}
extern "C" {
    pub fn ma_spatializer_get_attenuation_model(
        pSpatializer: *const ma_spatializer,
    ) -> ma_attenuation_model;
}
extern "C" {
    pub fn ma_spatializer_set_positioning(
        pSpatializer: *mut ma_spatializer,
        positioning: ma_positioning,
    );
}
extern "C" {
    pub fn ma_spatializer_get_positioning(pSpatializer: *const ma_spatializer) -> ma_positioning;
}
extern "C" {
    pub fn ma_spatializer_set_rolloff(pSpatializer: *mut ma_spatializer, rolloff: f32);
}
extern "C" {
    pub fn ma_spatializer_get_rolloff(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_min_gain(pSpatializer: *mut ma_spatializer, minGain: f32);
}
extern "C" {
    pub fn ma_spatializer_get_min_gain(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_max_gain(pSpatializer: *mut ma_spatializer, maxGain: f32);
}
extern "C" {
    pub fn ma_spatializer_get_max_gain(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_min_distance(pSpatializer: *mut ma_spatializer, minDistance: f32);
}
extern "C" {
    pub fn ma_spatializer_get_min_distance(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_max_distance(pSpatializer: *mut ma_spatializer, maxDistance: f32);
}
extern "C" {
    pub fn ma_spatializer_get_max_distance(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_cone(
        pSpatializer: *mut ma_spatializer,
        innerAngleInRadians: f32,
        outerAngleInRadians: f32,
        outerGain: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_get_cone(
        pSpatializer: *const ma_spatializer,
        pInnerAngleInRadians: *mut f32,
        pOuterAngleInRadians: *mut f32,
        pOuterGain: *mut f32,
    );
}
extern "C" {
    pub fn ma_spatializer_set_doppler_factor(pSpatializer: *mut ma_spatializer, dopplerFactor: f32);
}
extern "C" {
    pub fn ma_spatializer_get_doppler_factor(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_directional_attenuation_factor(
        pSpatializer: *mut ma_spatializer,
        directionalAttenuationFactor: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_get_directional_attenuation_factor(
        pSpatializer: *const ma_spatializer,
    ) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_position(pSpatializer: *mut ma_spatializer, x: f32, y: f32, z: f32);
}
extern "C" {
    pub fn ma_spatializer_get_position(pSpatializer: *const ma_spatializer) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_set_direction(pSpatializer: *mut ma_spatializer, x: f32, y: f32, z: f32);
}
extern "C" {
    pub fn ma_spatializer_get_direction(pSpatializer: *const ma_spatializer) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_set_velocity(pSpatializer: *mut ma_spatializer, x: f32, y: f32, z: f32);
}
extern "C" {
    pub fn ma_spatializer_get_velocity(pSpatializer: *const ma_spatializer) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_get_relative_position_and_direction(
        pSpatializer: *const ma_spatializer,
        pListener: *const ma_spatializer_listener,
        pRelativePos: *mut ma_vec3f,
        pRelativeDir: *mut ma_vec3f,
    );
}
#[doc = "Resampling"]
#[repr(C)]
#[derive(Debug)]
pub struct ma_linear_resampler_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub lpfOrder: ma_uint32,
    pub lpfNyquistFactor: f64,
}
#[test]
fn bindgen_test_layout_ma_linear_resampler_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_linear_resampler_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_linear_resampler_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_linear_resampler_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpfOrder) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(lpfOrder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpfNyquistFactor) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(lpfNyquistFactor)
        )
    );
}
extern "C" {
    pub fn ma_linear_resampler_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_linear_resampler_config;
}
#[repr(C)]
pub struct ma_linear_resampler {
    pub config: ma_linear_resampler_config,
    pub inAdvanceInt: ma_uint32,
    pub inAdvanceFrac: ma_uint32,
    pub inTimeInt: ma_uint32,
    pub inTimeFrac: ma_uint32,
    pub x0: ma_linear_resampler__bindgen_ty_1,
    pub x1: ma_linear_resampler__bindgen_ty_2,
    pub lpf: ma_lpf,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[repr(C)]
pub struct ma_linear_resampler__bindgen_ty_1 {
    pub f32_: __BindgenUnionField<*mut f32>,
    pub s16: __BindgenUnionField<*mut ma_int16>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_ma_linear_resampler__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_linear_resampler__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ma_linear_resampler__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_linear_resampler__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler__bindgen_ty_1),
            "::",
            stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler__bindgen_ty_1),
            "::",
            stringify!(s16)
        )
    );
}
#[repr(C)]
pub struct ma_linear_resampler__bindgen_ty_2 {
    pub f32_: __BindgenUnionField<*mut f32>,
    pub s16: __BindgenUnionField<*mut ma_int16>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_ma_linear_resampler__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_linear_resampler__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(ma_linear_resampler__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_linear_resampler__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler__bindgen_ty_2),
            "::",
            stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler__bindgen_ty_2),
            "::",
            stringify!(s16)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_linear_resampler() {
    const UNINIT: ::std::mem::MaybeUninit<ma_linear_resampler> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler>(),
        136usize,
        concat!("Size of: ", stringify!(ma_linear_resampler))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_linear_resampler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inAdvanceInt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(inAdvanceInt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inAdvanceFrac) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(inAdvanceFrac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inTimeInt) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(inTimeInt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inTimeFrac) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(inTimeFrac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x0) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(x0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x1) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(x1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpf) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(lpf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_linear_resampler_get_heap_size(
        pConfig: *const ma_linear_resampler_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_init_preallocated(
        pConfig: *const ma_linear_resampler_config,
        pHeap: *mut ::std::os::raw::c_void,
        pResampler: *mut ma_linear_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_init(
        pConfig: *const ma_linear_resampler_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pResampler: *mut ma_linear_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_uninit(
        pResampler: *mut ma_linear_resampler,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_linear_resampler_process_pcm_frames(
        pResampler: *mut ma_linear_resampler,
        pFramesIn: *const ::std::os::raw::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_set_rate(
        pResampler: *mut ma_linear_resampler,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_set_rate_ratio(
        pResampler: *mut ma_linear_resampler,
        ratioInOut: f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_get_input_latency(
        pResampler: *const ma_linear_resampler,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_linear_resampler_get_output_latency(
        pResampler: *const ma_linear_resampler,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_linear_resampler_get_required_input_frame_count(
        pResampler: *const ma_linear_resampler,
        outputFrameCount: ma_uint64,
        pInputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_get_expected_output_frame_count(
        pResampler: *const ma_linear_resampler,
        inputFrameCount: ma_uint64,
        pOutputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_reset(pResampler: *mut ma_linear_resampler) -> ma_result;
}
pub type ma_resampling_backend = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug)]
pub struct ma_resampling_backend_vtable {
    pub onGetHeapSize: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pConfig: *const ma_resampler_config,
            pHeapSizeInBytes: *mut usize,
        ) -> ma_result,
    >,
    pub onInit: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pConfig: *const ma_resampler_config,
            pHeap: *mut ::std::os::raw::c_void,
            ppBackend: *mut *mut ma_resampling_backend,
        ) -> ma_result,
    >,
    pub onUninit: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *mut ma_resampling_backend,
            pAllocationCallbacks: *const ma_allocation_callbacks,
        ),
    >,
    pub onProcess: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *mut ma_resampling_backend,
            pFramesIn: *const ::std::os::raw::c_void,
            pFrameCountIn: *mut ma_uint64,
            pFramesOut: *mut ::std::os::raw::c_void,
            pFrameCountOut: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onSetRate: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *mut ma_resampling_backend,
            sampleRateIn: ma_uint32,
            sampleRateOut: ma_uint32,
        ) -> ma_result,
    >,
    pub onGetInputLatency: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *const ma_resampling_backend,
        ) -> ma_uint64,
    >,
    pub onGetOutputLatency: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *const ma_resampling_backend,
        ) -> ma_uint64,
    >,
    pub onGetRequiredInputFrameCount: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *const ma_resampling_backend,
            outputFrameCount: ma_uint64,
            pInputFrameCount: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onGetExpectedOutputFrameCount: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *const ma_resampling_backend,
            inputFrameCount: ma_uint64,
            pOutputFrameCount: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onReset: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *mut ma_resampling_backend,
        ) -> ma_result,
    >,
}
#[test]
fn bindgen_test_layout_ma_resampling_backend_vtable() {
    const UNINIT: ::std::mem::MaybeUninit<ma_resampling_backend_vtable> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_resampling_backend_vtable>(),
        80usize,
        concat!("Size of: ", stringify!(ma_resampling_backend_vtable))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampling_backend_vtable>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampling_backend_vtable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onGetHeapSize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampling_backend_vtable),
            "::",
            stringify!(onGetHeapSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onInit) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampling_backend_vtable),
            "::",
            stringify!(onInit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onUninit) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampling_backend_vtable),
            "::",
            stringify!(onUninit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onProcess) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampling_backend_vtable),
            "::",
            stringify!(onProcess)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onSetRate) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampling_backend_vtable),
            "::",
            stringify!(onSetRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onGetInputLatency) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampling_backend_vtable),
            "::",
            stringify!(onGetInputLatency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onGetOutputLatency) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampling_backend_vtable),
            "::",
            stringify!(onGetOutputLatency)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).onGetRequiredInputFrameCount) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampling_backend_vtable),
            "::",
            stringify!(onGetRequiredInputFrameCount)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).onGetExpectedOutputFrameCount) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampling_backend_vtable),
            "::",
            stringify!(onGetExpectedOutputFrameCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onReset) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampling_backend_vtable),
            "::",
            stringify!(onReset)
        )
    );
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_resample_algorithm {
    ma_resample_algorithm_linear = 0,
    ma_resample_algorithm_custom = 1,
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_resampler_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub algorithm: ma_resample_algorithm,
    pub pBackendVTable: *mut ma_resampling_backend_vtable,
    pub pBackendUserData: *mut ::std::os::raw::c_void,
    pub linear: ma_resampler_config__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_resampler_config__bindgen_ty_1 {
    pub lpfOrder: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_resampler_config__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_resampler_config__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_resampler_config__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ma_resampler_config__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler_config__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_resampler_config__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpfOrder) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config__bindgen_ty_1),
            "::",
            stringify!(lpfOrder)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_resampler_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_resampler_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_resampler_config>(),
        48usize,
        concat!("Size of: ", stringify!(ma_resampler_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).algorithm) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(algorithm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackendVTable) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(pBackendVTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackendUserData) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(pBackendUserData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linear) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(linear)
        )
    );
}
extern "C" {
    pub fn ma_resampler_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
        algorithm: ma_resample_algorithm,
    ) -> ma_resampler_config;
}
#[repr(C)]
pub struct ma_resampler {
    pub pBackend: *mut ma_resampling_backend,
    pub pBackendVTable: *mut ma_resampling_backend_vtable,
    pub pBackendUserData: *mut ::std::os::raw::c_void,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub state: ma_resampler__bindgen_ty_1,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[repr(C)]
pub struct ma_resampler__bindgen_ty_1 {
    pub linear: __BindgenUnionField<ma_linear_resampler>,
    pub bindgen_union_field: [u64; 17usize],
}
#[test]
fn bindgen_test_layout_ma_resampler__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_resampler__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_resampler__bindgen_ty_1>(),
        136usize,
        concat!("Size of: ", stringify!(ma_resampler__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linear) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler__bindgen_ty_1),
            "::",
            stringify!(linear)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_resampler() {
    const UNINIT: ::std::mem::MaybeUninit<ma_resampler> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_resampler>(),
        192usize,
        concat!("Size of: ", stringify!(ma_resampler))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackend) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(pBackend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackendVTable) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(pBackendVTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackendUserData) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(pBackendUserData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_resampler_get_heap_size(
        pConfig: *const ma_resampler_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_init_preallocated(
        pConfig: *const ma_resampler_config,
        pHeap: *mut ::std::os::raw::c_void,
        pResampler: *mut ma_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_init(
        pConfig: *const ma_resampler_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pResampler: *mut ma_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_uninit(
        pResampler: *mut ma_resampler,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_resampler_process_pcm_frames(
        pResampler: *mut ma_resampler,
        pFramesIn: *const ::std::os::raw::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_set_rate(
        pResampler: *mut ma_resampler,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_set_rate_ratio(pResampler: *mut ma_resampler, ratio: f32) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_get_input_latency(pResampler: *const ma_resampler) -> ma_uint64;
}
extern "C" {
    pub fn ma_resampler_get_output_latency(pResampler: *const ma_resampler) -> ma_uint64;
}
extern "C" {
    pub fn ma_resampler_get_required_input_frame_count(
        pResampler: *const ma_resampler,
        outputFrameCount: ma_uint64,
        pInputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_get_expected_output_frame_count(
        pResampler: *const ma_resampler,
        inputFrameCount: ma_uint64,
        pOutputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_reset(pResampler: *mut ma_resampler) -> ma_result;
}
#[repr(u32)]
#[doc = "Channel Conversion"]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_channel_conversion_path {
    ma_channel_conversion_path_unknown = 0,
    ma_channel_conversion_path_passthrough = 1,
    ma_channel_conversion_path_mono_out = 2,
    ma_channel_conversion_path_mono_in = 3,
    ma_channel_conversion_path_shuffle = 4,
    ma_channel_conversion_path_weights = 5,
}
impl ma_mono_expansion_mode {
    pub const ma_mono_expansion_mode_default: ma_mono_expansion_mode =
        ma_mono_expansion_mode::ma_mono_expansion_mode_duplicate;
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_mono_expansion_mode {
    ma_mono_expansion_mode_duplicate = 0,
    ma_mono_expansion_mode_average = 1,
    ma_mono_expansion_mode_stereo_only = 2,
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_channel_converter_config {
    pub format: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub pChannelMapIn: *const ma_channel,
    pub pChannelMapOut: *const ma_channel,
    pub mixingMode: ma_channel_mix_mode,
    pub calculateLFEFromSpatialChannels: ma_bool32,
    pub ppWeights: *mut *mut f32,
}
#[test]
fn bindgen_test_layout_ma_channel_converter_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_channel_converter_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_channel_converter_config>(),
        48usize,
        concat!("Size of: ", stringify!(ma_channel_converter_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_channel_converter_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_channel_converter_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapIn) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(pChannelMapIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapOut) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(pChannelMapOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mixingMode) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(mixingMode)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).calculateLFEFromSpatialChannels) as usize - ptr as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(calculateLFEFromSpatialChannels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ppWeights) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(ppWeights)
        )
    );
}
extern "C" {
    pub fn ma_channel_converter_config_init(
        format: ma_format,
        channelsIn: ma_uint32,
        pChannelMapIn: *const ma_channel,
        channelsOut: ma_uint32,
        pChannelMapOut: *const ma_channel,
        mixingMode: ma_channel_mix_mode,
    ) -> ma_channel_converter_config;
}
#[repr(C)]
pub struct ma_channel_converter {
    pub format: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub mixingMode: ma_channel_mix_mode,
    pub conversionPath: ma_channel_conversion_path,
    pub pChannelMapIn: *mut ma_channel,
    pub pChannelMapOut: *mut ma_channel,
    pub pShuffleTable: *mut ma_uint8,
    pub weights: ma_channel_converter__bindgen_ty_1,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[repr(C)]
pub struct ma_channel_converter__bindgen_ty_1 {
    pub f32_: __BindgenUnionField<*mut *mut f32>,
    pub s16: __BindgenUnionField<*mut *mut ma_int32>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_ma_channel_converter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_channel_converter__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_channel_converter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ma_channel_converter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_channel_converter__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_channel_converter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter__bindgen_ty_1),
            "::",
            stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter__bindgen_ty_1),
            "::",
            stringify!(s16)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_channel_converter() {
    const UNINIT: ::std::mem::MaybeUninit<ma_channel_converter> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_channel_converter>(),
        72usize,
        concat!("Size of: ", stringify!(ma_channel_converter))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_channel_converter>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_channel_converter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mixingMode) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(mixingMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conversionPath) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(conversionPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapIn) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(pChannelMapIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapOut) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(pChannelMapOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pShuffleTable) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(pShuffleTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).weights) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(weights)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_channel_converter_get_heap_size(
        pConfig: *const ma_channel_converter_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_init_preallocated(
        pConfig: *const ma_channel_converter_config,
        pHeap: *mut ::std::os::raw::c_void,
        pConverter: *mut ma_channel_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_init(
        pConfig: *const ma_channel_converter_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pConverter: *mut ma_channel_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_uninit(
        pConverter: *mut ma_channel_converter,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_channel_converter_process_pcm_frames(
        pConverter: *mut ma_channel_converter,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_get_input_channel_map(
        pConverter: *const ma_channel_converter,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_get_output_channel_map(
        pConverter: *const ma_channel_converter,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
    ) -> ma_result;
}
#[doc = "Data Conversion"]
#[repr(C)]
#[derive(Debug)]
pub struct ma_data_converter_config {
    pub formatIn: ma_format,
    pub formatOut: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub pChannelMapIn: *mut ma_channel,
    pub pChannelMapOut: *mut ma_channel,
    pub ditherMode: ma_dither_mode,
    pub channelMixMode: ma_channel_mix_mode,
    pub calculateLFEFromSpatialChannels: ma_bool32,
    pub ppChannelWeights: *mut *mut f32,
    pub allowDynamicSampleRate: ma_bool32,
    pub resampling: ma_resampler_config,
}
#[test]
fn bindgen_test_layout_ma_data_converter_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_data_converter_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_data_converter_config>(),
        120usize,
        concat!("Size of: ", stringify!(ma_data_converter_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_converter_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_converter_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatIn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(formatIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatOut) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(formatOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapIn) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(pChannelMapIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapOut) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(pChannelMapOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ditherMode) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(ditherMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelMixMode) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(channelMixMode)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).calculateLFEFromSpatialChannels) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(calculateLFEFromSpatialChannels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ppChannelWeights) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(ppChannelWeights)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allowDynamicSampleRate) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(allowDynamicSampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resampling) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(resampling)
        )
    );
}
extern "C" {
    pub fn ma_data_converter_config_init_default() -> ma_data_converter_config;
}
extern "C" {
    pub fn ma_data_converter_config_init(
        formatIn: ma_format,
        formatOut: ma_format,
        channelsIn: ma_uint32,
        channelsOut: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_data_converter_config;
}
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum ma_data_converter_execution_path {
    ma_data_converter_execution_path_passthrough = 0,
    ma_data_converter_execution_path_format_only = 1,
    ma_data_converter_execution_path_channels_only = 2,
    ma_data_converter_execution_path_resample_only = 3,
    ma_data_converter_execution_path_resample_first = 4,
    ma_data_converter_execution_path_channels_first = 5,
}
#[repr(C)]
pub struct ma_data_converter {
    pub formatIn: ma_format,
    pub formatOut: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub ditherMode: ma_dither_mode,
    pub executionPath: ma_data_converter_execution_path,
    pub channelConverter: ma_channel_converter,
    pub resampler: ma_resampler,
    pub hasPreFormatConversion: ma_bool8,
    pub hasPostFormatConversion: ma_bool8,
    pub hasChannelConverter: ma_bool8,
    pub hasResampler: ma_bool8,
    pub isPassthrough: ma_bool8,
    pub _ownsHeap: ma_bool8,
    pub _pHeap: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_data_converter() {
    const UNINIT: ::std::mem::MaybeUninit<ma_data_converter> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_data_converter>(),
        312usize,
        concat!("Size of: ", stringify!(ma_data_converter))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_converter>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_converter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatIn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(formatIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatOut) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(formatOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ditherMode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(ditherMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).executionPath) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(executionPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelConverter) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(channelConverter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resampler) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(resampler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasPreFormatConversion) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(hasPreFormatConversion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasPostFormatConversion) as usize - ptr as usize },
        297usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(hasPostFormatConversion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasChannelConverter) as usize - ptr as usize },
        298usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(hasChannelConverter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasResampler) as usize - ptr as usize },
        299usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(hasResampler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isPassthrough) as usize - ptr as usize },
        300usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(isPassthrough)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        301usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(_ownsHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(_pHeap)
        )
    );
}
extern "C" {
    pub fn ma_data_converter_get_heap_size(
        pConfig: *const ma_data_converter_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_init_preallocated(
        pConfig: *const ma_data_converter_config,
        pHeap: *mut ::std::os::raw::c_void,
        pConverter: *mut ma_data_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_init(
        pConfig: *const ma_data_converter_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pConverter: *mut ma_data_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_uninit(
        pConverter: *mut ma_data_converter,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_data_converter_process_pcm_frames(
        pConverter: *mut ma_data_converter,
        pFramesIn: *const ::std::os::raw::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_set_rate(
        pConverter: *mut ma_data_converter,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_set_rate_ratio(
        pConverter: *mut ma_data_converter,
        ratioInOut: f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_get_input_latency(pConverter: *const ma_data_converter) -> ma_uint64;
}
extern "C" {
    pub fn ma_data_converter_get_output_latency(pConverter: *const ma_data_converter) -> ma_uint64;
}
extern "C" {
    pub fn ma_data_converter_get_required_input_frame_count(
        pConverter: *const ma_data_converter,
        outputFrameCount: ma_uint64,
        pInputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_get_expected_output_frame_count(
        pConverter: *const ma_data_converter,
        inputFrameCount: ma_uint64,
        pOutputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_get_input_channel_map(
        pConverter: *const ma_data_converter,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_get_output_channel_map(
        pConverter: *const ma_data_converter,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_reset(pConverter: *mut ma_data_converter) -> ma_result;
}
extern "C" {
    #[doc = "Format Conversion"]
    pub fn ma_pcm_u8_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_convert(
        pOut: *mut ::std::os::raw::c_void,
        formatOut: ma_format,
        pIn: *const ::std::os::raw::c_void,
        formatIn: ma_format,
        sampleCount: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_convert_pcm_frames_format(
        pOut: *mut ::std::os::raw::c_void,
        formatOut: ma_format,
        pIn: *const ::std::os::raw::c_void,
        formatIn: ma_format,
        frameCount: ma_uint64,
        channels: ma_uint32,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_deinterleave_pcm_frames(
        format: ma_format,
        channels: ma_uint32,
        frameCount: ma_uint64,
        pInterleavedPCMFrames: *const ::std::os::raw::c_void,
        ppDeinterleavedPCMFrames: *mut *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn ma_interleave_pcm_frames(
        format: ma_format,
        channels: ma_uint32,
        frameCount: ma_uint64,
        ppDeinterleavedPCMFrames: *mut *const ::std::os::raw::c_void,
        pInterleavedPCMFrames: *mut ::std::os::raw::c_void,
    );
}
pub const MA_CHANNEL_INDEX_NULL: u32 = 255;
extern "C" {
    pub fn ma_channel_map_get_channel(
        pChannelMap: *const ma_channel,
        channelCount: ma_uint32,
        channelIndex: ma_uint32,
    ) -> ma_channel;
}
extern "C" {
    pub fn ma_channel_map_init_blank(pChannelMap: *mut ma_channel, channels: ma_uint32);
}
extern "C" {
    pub fn ma_channel_map_init_standard(
        standardChannelMap: ma_standard_channel_map,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_channel_map_copy(pOut: *mut ma_channel, pIn: *const ma_channel, channels: ma_uint32);
}
extern "C" {
    pub fn ma_channel_map_copy_or_default(
        pOut: *mut ma_channel,
        channelMapCapOut: usize,
        pIn: *const ma_channel,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_channel_map_is_valid(
        pChannelMap: *const ma_channel,
        channels: ma_uint32,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_is_equal(
        pChannelMapA: *const ma_channel,
        pChannelMapB: *const ma_channel,
        channels: ma_uint32,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_is_blank(
        pChannelMap: *const ma_channel,
        channels: ma_uint32,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_contains_channel_position(
        channels: ma_uint32,
        pChannelMap: *const ma_channel,
        channelPosition: ma_channel,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_find_channel_position(
        channels: ma_uint32,
        pChannelMap: *const ma_channel,
        channelPosition: ma_channel,
        pChannelIndex: *mut ma_uint32,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_to_string(
        pChannelMap: *const ma_channel,
        channels: ma_uint32,
        pBufferOut: *mut ::std::os::raw::c_char,
        bufferCap: usize,
    ) -> usize;
}
extern "C" {
    pub fn ma_channel_position_to_string(channel: ma_channel) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Conversion Helpers"]
    pub fn ma_convert_frames(
        pOut: *mut ::std::os::raw::c_void,
        frameCountOut: ma_uint64,
        formatOut: ma_format,
        channelsOut: ma_uint32,
        sampleRateOut: ma_uint32,
        pIn: *const ::std::os::raw::c_void,
        frameCountIn: ma_uint64,
        formatIn: ma_format,
        channelsIn: ma_uint32,
        sampleRateIn: ma_uint32,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_convert_frames_ex(
        pOut: *mut ::std::os::raw::c_void,
        frameCountOut: ma_uint64,
        pIn: *const ::std::os::raw::c_void,
        frameCountIn: ma_uint64,
        pConfig: *const ma_data_converter_config,
    ) -> ma_uint64;
}
#[doc = "Data Source"]
pub type ma_data_source = ::std::os::raw::c_void;
pub const MA_DATA_SOURCE_SELF_MANAGED_RANGE_AND_LOOP_POINT: u32 = 1;
#[repr(C)]
#[derive(Debug)]
pub struct ma_data_source_vtable {
    pub onRead: ::std::option::Option<
        unsafe extern "C" fn(
            pDataSource: *mut ma_data_source,
            pFramesOut: *mut ::std::os::raw::c_void,
            frameCount: ma_uint64,
            pFramesRead: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onSeek: ::std::option::Option<
        unsafe extern "C" fn(pDataSource: *mut ma_data_source, frameIndex: ma_uint64) -> ma_result,
    >,
    pub onGetDataFormat: ::std::option::Option<
        unsafe extern "C" fn(
            pDataSource: *mut ma_data_source,
            pFormat: *mut ma_format,
            pChannels: *mut ma_uint32,
            pSampleRate: *mut ma_uint32,
            pChannelMap: *mut ma_channel,
            channelMapCap: usize,
        ) -> ma_result,
    >,
    pub onGetCursor: ::std::option::Option<
        unsafe extern "C" fn(
            pDataSource: *mut ma_data_source,
            pCursor: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onGetLength: ::std::option::Option<
        unsafe extern "C" fn(
            pDataSource: *mut ma_data_source,
            pLength: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onSetLooping: ::std::option::Option<
        unsafe extern "C" fn(pDataSource: *mut ma_data_source, isLooping: ma_bool32) -> ma_result,
    >,
    pub flags: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_data_source_vtable() {
    const UNINIT: ::std::mem::MaybeUninit<ma_data_source_vtable> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_data_source_vtable>(),
        56usize,
        concat!("Size of: ", stringify!(ma_data_source_vtable))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_source_vtable>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_source_vtable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onRead) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_vtable),
            "::",
            stringify!(onRead)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onSeek) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_vtable),
            "::",
            stringify!(onSeek)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onGetDataFormat) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_vtable),
            "::",
            stringify!(onGetDataFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onGetCursor) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_vtable),
            "::",
            stringify!(onGetCursor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onGetLength) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_vtable),
            "::",
            stringify!(onGetLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onSetLooping) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_vtable),
            "::",
            stringify!(onSetLooping)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_vtable),
            "::",
            stringify!(flags)
        )
    );
}
pub type ma_data_source_get_next_proc = ::std::option::Option<
    unsafe extern "C" fn(pDataSource: *mut ma_data_source) -> *mut ma_data_source,
>;
#[repr(C)]
#[derive(Debug)]
pub struct ma_data_source_config {
    pub vtable: *const ma_data_source_vtable,
}
#[test]
fn bindgen_test_layout_ma_data_source_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_data_source_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_data_source_config>(),
        8usize,
        concat!("Size of: ", stringify!(ma_data_source_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_source_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_source_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vtable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_config),
            "::",
            stringify!(vtable)
        )
    );
}
extern "C" {
    pub fn ma_data_source_config_init() -> ma_data_source_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_data_source_base {
    pub vtable: *const ma_data_source_vtable,
    pub rangeBegInFrames: ma_uint64,
    pub rangeEndInFrames: ma_uint64,
    pub loopBegInFrames: ma_uint64,
    pub loopEndInFrames: ma_uint64,
    pub pCurrent: *mut ma_data_source,
    pub pNext: *mut ma_data_source,
    pub onGetNext: ma_data_source_get_next_proc,
    pub isLooping: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_data_source_base() {
    const UNINIT: ::std::mem::MaybeUninit<ma_data_source_base> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_data_source_base>(),
        72usize,
        concat!("Size of: ", stringify!(ma_data_source_base))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_source_base>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_source_base))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vtable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_base),
            "::",
            stringify!(vtable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangeBegInFrames) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_base),
            "::",
            stringify!(rangeBegInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangeEndInFrames) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_base),
            "::",
            stringify!(rangeEndInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loopBegInFrames) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_base),
            "::",
            stringify!(loopBegInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loopEndInFrames) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_base),
            "::",
            stringify!(loopEndInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pCurrent) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_base),
            "::",
            stringify!(pCurrent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_base),
            "::",
            stringify!(pNext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onGetNext) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_base),
            "::",
            stringify!(onGetNext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isLooping) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_base),
            "::",
            stringify!(isLooping)
        )
    );
}
extern "C" {
    pub fn ma_data_source_init(
        pConfig: *const ma_data_source_config,
        pDataSource: *mut ma_data_source,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_uninit(pDataSource: *mut ma_data_source);
}
extern "C" {
    pub fn ma_data_source_read_pcm_frames(
        pDataSource: *mut ma_data_source,
        pFramesOut: *mut ::std::os::raw::c_void,
        frameCount: ma_uint64,
        pFramesRead: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_seek_pcm_frames(
        pDataSource: *mut ma_data_source,
        frameCount: ma_uint64,
        pFramesSeeked: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_seek_to_pcm_frame(
        pDataSource: *mut ma_data_source,
        frameIndex: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_get_data_format(
        pDataSource: *mut ma_data_source,
        pFormat: *mut ma_format,
        pChannels: *mut ma_uint32,
        pSampleRate: *mut ma_uint32,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_get_cursor_in_pcm_frames(
        pDataSource: *mut ma_data_source,
        pCursor: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_get_length_in_pcm_frames(
        pDataSource: *mut ma_data_source,
        pLength: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_get_cursor_in_seconds(
        pDataSource: *mut ma_data_source,
        pCursor: *mut f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_get_length_in_seconds(
        pDataSource: *mut ma_data_source,
        pLength: *mut f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_set_looping(
        pDataSource: *mut ma_data_source,
        isLooping: ma_bool32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_is_looping(pDataSource: *const ma_data_source) -> ma_bool32;
}
extern "C" {
    pub fn ma_data_source_set_range_in_pcm_frames(
        pDataSource: *mut ma_data_source,
        rangeBegInFrames: ma_uint64,
        rangeEndInFrames: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_get_range_in_pcm_frames(
        pDataSource: *const ma_data_source,
        pRangeBegInFrames: *mut ma_uint64,
        pRangeEndInFrames: *mut ma_uint64,
    );
}
extern "C" {
    pub fn ma_data_source_set_loop_point_in_pcm_frames(
        pDataSource: *mut ma_data_source,
        loopBegInFrames: ma_uint64,
        loopEndInFrames: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_get_loop_point_in_pcm_frames(
        pDataSource: *const ma_data_source,
        pLoopBegInFrames: *mut ma_uint64,
        pLoopEndInFrames: *mut ma_uint64,
    );
}
extern "C" {
    pub fn ma_data_source_set_current(
        pDataSource: *mut ma_data_source,
        pCurrentDataSource: *mut ma_data_source,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_get_current(pDataSource: *const ma_data_source) -> *mut ma_data_source;
}
extern "C" {
    pub fn ma_data_source_set_next(
        pDataSource: *mut ma_data_source,
        pNextDataSource: *mut ma_data_source,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_get_next(pDataSource: *const ma_data_source) -> *mut ma_data_source;
}
extern "C" {
    pub fn ma_data_source_set_next_callback(
        pDataSource: *mut ma_data_source,
        onGetNext: ma_data_source_get_next_proc,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_source_get_next_callback(
        pDataSource: *const ma_data_source,
    ) -> ma_data_source_get_next_proc;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_audio_buffer_ref {
    pub ds: ma_data_source_base,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cursor: ma_uint64,
    pub sizeInFrames: ma_uint64,
    pub pData: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_audio_buffer_ref() {
    const UNINIT: ::std::mem::MaybeUninit<ma_audio_buffer_ref> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_audio_buffer_ref>(),
        112usize,
        concat!("Size of: ", stringify!(ma_audio_buffer_ref))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_audio_buffer_ref>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_audio_buffer_ref))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ds) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_ref),
            "::",
            stringify!(ds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_ref),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_ref),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_ref),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cursor) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_ref),
            "::",
            stringify!(cursor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sizeInFrames) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_ref),
            "::",
            stringify!(sizeInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pData) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_ref),
            "::",
            stringify!(pData)
        )
    );
}
extern "C" {
    pub fn ma_audio_buffer_ref_init(
        format: ma_format,
        channels: ma_uint32,
        pData: *const ::std::os::raw::c_void,
        sizeInFrames: ma_uint64,
        pAudioBufferRef: *mut ma_audio_buffer_ref,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_ref_uninit(pAudioBufferRef: *mut ma_audio_buffer_ref);
}
extern "C" {
    pub fn ma_audio_buffer_ref_set_data(
        pAudioBufferRef: *mut ma_audio_buffer_ref,
        pData: *const ::std::os::raw::c_void,
        sizeInFrames: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_ref_read_pcm_frames(
        pAudioBufferRef: *mut ma_audio_buffer_ref,
        pFramesOut: *mut ::std::os::raw::c_void,
        frameCount: ma_uint64,
        loop_: ma_bool32,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_audio_buffer_ref_seek_to_pcm_frame(
        pAudioBufferRef: *mut ma_audio_buffer_ref,
        frameIndex: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_ref_map(
        pAudioBufferRef: *mut ma_audio_buffer_ref,
        ppFramesOut: *mut *mut ::std::os::raw::c_void,
        pFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_ref_unmap(
        pAudioBufferRef: *mut ma_audio_buffer_ref,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_ref_at_end(pAudioBufferRef: *const ma_audio_buffer_ref) -> ma_bool32;
}
extern "C" {
    pub fn ma_audio_buffer_ref_get_cursor_in_pcm_frames(
        pAudioBufferRef: *const ma_audio_buffer_ref,
        pCursor: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_ref_get_length_in_pcm_frames(
        pAudioBufferRef: *const ma_audio_buffer_ref,
        pLength: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_ref_get_available_frames(
        pAudioBufferRef: *const ma_audio_buffer_ref,
        pAvailableFrames: *mut ma_uint64,
    ) -> ma_result;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_audio_buffer_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub sizeInFrames: ma_uint64,
    pub pData: *const ::std::os::raw::c_void,
    pub allocationCallbacks: ma_allocation_callbacks,
}
#[test]
fn bindgen_test_layout_ma_audio_buffer_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_audio_buffer_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_audio_buffer_config>(),
        64usize,
        concat!("Size of: ", stringify!(ma_audio_buffer_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_audio_buffer_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_audio_buffer_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sizeInFrames) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_config),
            "::",
            stringify!(sizeInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pData) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_config),
            "::",
            stringify!(pData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocationCallbacks) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer_config),
            "::",
            stringify!(allocationCallbacks)
        )
    );
}
extern "C" {
    pub fn ma_audio_buffer_config_init(
        format: ma_format,
        channels: ma_uint32,
        sizeInFrames: ma_uint64,
        pData: *const ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> ma_audio_buffer_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_audio_buffer {
    pub ref_: ma_audio_buffer_ref,
    pub allocationCallbacks: ma_allocation_callbacks,
    pub ownsData: ma_bool32,
    pub _pExtraData: [ma_uint8; 1usize],
}
#[test]
fn bindgen_test_layout_ma_audio_buffer() {
    const UNINIT: ::std::mem::MaybeUninit<ma_audio_buffer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_audio_buffer>(),
        152usize,
        concat!("Size of: ", stringify!(ma_audio_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_audio_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_audio_buffer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ref_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocationCallbacks) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer),
            "::",
            stringify!(allocationCallbacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ownsData) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer),
            "::",
            stringify!(ownsData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pExtraData) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_audio_buffer),
            "::",
            stringify!(_pExtraData)
        )
    );
}
extern "C" {
    pub fn ma_audio_buffer_init(
        pConfig: *const ma_audio_buffer_config,
        pAudioBuffer: *mut ma_audio_buffer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_init_copy(
        pConfig: *const ma_audio_buffer_config,
        pAudioBuffer: *mut ma_audio_buffer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_alloc_and_init(
        pConfig: *const ma_audio_buffer_config,
        ppAudioBuffer: *mut *mut ma_audio_buffer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_uninit(pAudioBuffer: *mut ma_audio_buffer);
}
extern "C" {
    pub fn ma_audio_buffer_uninit_and_free(pAudioBuffer: *mut ma_audio_buffer);
}
extern "C" {
    pub fn ma_audio_buffer_read_pcm_frames(
        pAudioBuffer: *mut ma_audio_buffer,
        pFramesOut: *mut ::std::os::raw::c_void,
        frameCount: ma_uint64,
        loop_: ma_bool32,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_audio_buffer_seek_to_pcm_frame(
        pAudioBuffer: *mut ma_audio_buffer,
        frameIndex: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_map(
        pAudioBuffer: *mut ma_audio_buffer,
        ppFramesOut: *mut *mut ::std::os::raw::c_void,
        pFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_unmap(
        pAudioBuffer: *mut ma_audio_buffer,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_at_end(pAudioBuffer: *const ma_audio_buffer) -> ma_bool32;
}
extern "C" {
    pub fn ma_audio_buffer_get_cursor_in_pcm_frames(
        pAudioBuffer: *const ma_audio_buffer,
        pCursor: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_get_length_in_pcm_frames(
        pAudioBuffer: *const ma_audio_buffer,
        pLength: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_audio_buffer_get_available_frames(
        pAudioBuffer: *const ma_audio_buffer,
        pAvailableFrames: *mut ma_uint64,
    ) -> ma_result;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_paged_audio_buffer_page {
    pub pNext: *mut ma_paged_audio_buffer_page,
    pub sizeInFrames: ma_uint64,
    pub pAudioData: [ma_uint8; 1usize],
}
#[test]
fn bindgen_test_layout_ma_paged_audio_buffer_page() {
    const UNINIT: ::std::mem::MaybeUninit<ma_paged_audio_buffer_page> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_paged_audio_buffer_page>(),
        24usize,
        concat!("Size of: ", stringify!(ma_paged_audio_buffer_page))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_paged_audio_buffer_page>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_paged_audio_buffer_page))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer_page),
            "::",
            stringify!(pNext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sizeInFrames) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer_page),
            "::",
            stringify!(sizeInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pAudioData) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer_page),
            "::",
            stringify!(pAudioData)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_paged_audio_buffer_data {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub head: ma_paged_audio_buffer_page,
    pub pTail: *mut ma_paged_audio_buffer_page,
}
#[test]
fn bindgen_test_layout_ma_paged_audio_buffer_data() {
    const UNINIT: ::std::mem::MaybeUninit<ma_paged_audio_buffer_data> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_paged_audio_buffer_data>(),
        40usize,
        concat!("Size of: ", stringify!(ma_paged_audio_buffer_data))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_paged_audio_buffer_data>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_paged_audio_buffer_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer_data),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer_data),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer_data),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pTail) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer_data),
            "::",
            stringify!(pTail)
        )
    );
}
extern "C" {
    pub fn ma_paged_audio_buffer_data_init(
        format: ma_format,
        channels: ma_uint32,
        pData: *mut ma_paged_audio_buffer_data,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_paged_audio_buffer_data_uninit(
        pData: *mut ma_paged_audio_buffer_data,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_paged_audio_buffer_data_get_head(
        pData: *mut ma_paged_audio_buffer_data,
    ) -> *mut ma_paged_audio_buffer_page;
}
extern "C" {
    pub fn ma_paged_audio_buffer_data_get_tail(
        pData: *mut ma_paged_audio_buffer_data,
    ) -> *mut ma_paged_audio_buffer_page;
}
extern "C" {
    pub fn ma_paged_audio_buffer_data_get_length_in_pcm_frames(
        pData: *mut ma_paged_audio_buffer_data,
        pLength: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_paged_audio_buffer_data_allocate_page(
        pData: *mut ma_paged_audio_buffer_data,
        pageSizeInFrames: ma_uint64,
        pInitialData: *const ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        ppPage: *mut *mut ma_paged_audio_buffer_page,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_paged_audio_buffer_data_free_page(
        pData: *mut ma_paged_audio_buffer_data,
        pPage: *mut ma_paged_audio_buffer_page,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_paged_audio_buffer_data_append_page(
        pData: *mut ma_paged_audio_buffer_data,
        pPage: *mut ma_paged_audio_buffer_page,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_paged_audio_buffer_data_allocate_and_append_page(
        pData: *mut ma_paged_audio_buffer_data,
        pageSizeInFrames: ma_uint32,
        pInitialData: *const ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> ma_result;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_paged_audio_buffer_config {
    pub pData: *mut ma_paged_audio_buffer_data,
}
#[test]
fn bindgen_test_layout_ma_paged_audio_buffer_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_paged_audio_buffer_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_paged_audio_buffer_config>(),
        8usize,
        concat!("Size of: ", stringify!(ma_paged_audio_buffer_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_paged_audio_buffer_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_paged_audio_buffer_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer_config),
            "::",
            stringify!(pData)
        )
    );
}
extern "C" {
    pub fn ma_paged_audio_buffer_config_init(
        pData: *mut ma_paged_audio_buffer_data,
    ) -> ma_paged_audio_buffer_config;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_paged_audio_buffer {
    pub ds: ma_data_source_base,
    pub pData: *mut ma_paged_audio_buffer_data,
    pub pCurrent: *mut ma_paged_audio_buffer_page,
    pub relativeCursor: ma_uint64,
    pub absoluteCursor: ma_uint64,
}
#[test]
fn bindgen_test_layout_ma_paged_audio_buffer() {
    const UNINIT: ::std::mem::MaybeUninit<ma_paged_audio_buffer> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_paged_audio_buffer>(),
        104usize,
        concat!("Size of: ", stringify!(ma_paged_audio_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_paged_audio_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_paged_audio_buffer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ds) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer),
            "::",
            stringify!(ds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pData) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer),
            "::",
            stringify!(pData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pCurrent) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer),
            "::",
            stringify!(pCurrent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relativeCursor) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer),
            "::",
            stringify!(relativeCursor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absoluteCursor) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_paged_audio_buffer),
            "::",
            stringify!(absoluteCursor)
        )
    );
}
extern "C" {
    pub fn ma_paged_audio_buffer_init(
        pConfig: *const ma_paged_audio_buffer_config,
        pPagedAudioBuffer: *mut ma_paged_audio_buffer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_paged_audio_buffer_uninit(pPagedAudioBuffer: *mut ma_paged_audio_buffer);
}
extern "C" {
    pub fn ma_paged_audio_buffer_read_pcm_frames(
        pPagedAudioBuffer: *mut ma_paged_audio_buffer,
        pFramesOut: *mut ::std::os::raw::c_void,
        frameCount: ma_uint64,
        pFramesRead: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_paged_audio_buffer_seek_to_pcm_frame(
        pPagedAudioBuffer: *mut ma_paged_audio_buffer,
        frameIndex: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_paged_audio_buffer_get_cursor_in_pcm_frames(
        pPagedAudioBuffer: *mut ma_paged_audio_buffer,
        pCursor: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_paged_audio_buffer_get_length_in_pcm_frames(
        pPagedAudioBuffer: *mut ma_paged_audio_buffer,
        pLength: *mut ma_uint64,
    ) -> ma_result;
}
#[doc = "Ring Buffer"]
#[repr(C)]
#[derive(Debug)]
pub struct ma_rb {
    pub pBuffer: *mut ::std::os::raw::c_void,
    pub subbufferSizeInBytes: ma_uint32,
    pub subbufferCount: ma_uint32,
    pub subbufferStrideInBytes: ma_uint32,
    pub encodedReadOffset: ma_uint32,
    pub encodedWriteOffset: ma_uint32,
    pub ownsBuffer: ma_bool8,
    pub clearOnWriteAcquire: ma_bool8,
    pub allocationCallbacks: ma_allocation_callbacks,
}
#[test]
fn bindgen_test_layout_ma_rb() {
    const UNINIT: ::std::mem::MaybeUninit<ma_rb> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_rb>(),
        64usize,
        concat!("Size of: ", stringify!(ma_rb))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_rb))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBuffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(pBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subbufferSizeInBytes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(subbufferSizeInBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subbufferCount) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(subbufferCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subbufferStrideInBytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(subbufferStrideInBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encodedReadOffset) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(encodedReadOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encodedWriteOffset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(encodedWriteOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ownsBuffer) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(ownsBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clearOnWriteAcquire) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(clearOnWriteAcquire)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocationCallbacks) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(allocationCallbacks)
        )
    );
}
extern "C" {
    pub fn ma_rb_init_ex(
        subbufferSizeInBytes: usize,
        subbufferCount: usize,
        subbufferStrideInBytes: usize,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_init(
        bufferSizeInBytes: usize,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_uninit(pRB: *mut ma_rb);
}
extern "C" {
    pub fn ma_rb_reset(pRB: *mut ma_rb);
}
extern "C" {
    pub fn ma_rb_acquire_read(
        pRB: *mut ma_rb,
        pSizeInBytes: *mut usize,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_commit_read(pRB: *mut ma_rb, sizeInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_acquire_write(
        pRB: *mut ma_rb,
        pSizeInBytes: *mut usize,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_commit_write(pRB: *mut ma_rb, sizeInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_seek_read(pRB: *mut ma_rb, offsetInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_seek_write(pRB: *mut ma_rb, offsetInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_pointer_distance(pRB: *mut ma_rb) -> ma_int32;
}
extern "C" {
    pub fn ma_rb_available_read(pRB: *mut ma_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_rb_available_write(pRB: *mut ma_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_size(pRB: *mut ma_rb) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_stride(pRB: *mut ma_rb) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_offset(pRB: *mut ma_rb, subbufferIndex: usize) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_ptr(
        pRB: *mut ma_rb,
        subbufferIndex: usize,
        pBuffer: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_pcm_rb {
    pub ds: ma_data_source_base,
    pub rb: ma_rb,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_pcm_rb() {
    const UNINIT: ::std::mem::MaybeUninit<ma_pcm_rb> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_pcm_rb>(),
        152usize,
        concat!("Size of: ", stringify!(ma_pcm_rb))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_pcm_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_pcm_rb))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ds) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_pcm_rb),
            "::",
            stringify!(ds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rb) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_pcm_rb),
            "::",
            stringify!(rb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_pcm_rb),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_pcm_rb),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_pcm_rb),
            "::",
            stringify!(sampleRate)
        )
    );
}
extern "C" {
    pub fn ma_pcm_rb_init_ex(
        format: ma_format,
        channels: ma_uint32,
        subbufferSizeInFrames: ma_uint32,
        subbufferCount: ma_uint32,
        subbufferStrideInFrames: ma_uint32,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_pcm_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_init(
        format: ma_format,
        channels: ma_uint32,
        bufferSizeInFrames: ma_uint32,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_pcm_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_uninit(pRB: *mut ma_pcm_rb);
}
extern "C" {
    pub fn ma_pcm_rb_reset(pRB: *mut ma_pcm_rb);
}
extern "C" {
    pub fn ma_pcm_rb_acquire_read(
        pRB: *mut ma_pcm_rb,
        pSizeInFrames: *mut ma_uint32,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_commit_read(pRB: *mut ma_pcm_rb, sizeInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_acquire_write(
        pRB: *mut ma_pcm_rb,
        pSizeInFrames: *mut ma_uint32,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_commit_write(pRB: *mut ma_pcm_rb, sizeInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_seek_read(pRB: *mut ma_pcm_rb, offsetInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_seek_write(pRB: *mut ma_pcm_rb, offsetInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_pointer_distance(pRB: *mut ma_pcm_rb) -> ma_int32;
}
extern "C" {
    pub fn ma_pcm_rb_available_read(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_available_write(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_size(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_stride(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_offset(
        pRB: *mut ma_pcm_rb,
        subbufferIndex: ma_uint32,
    ) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_ptr(
        pRB: *mut ma_pcm_rb,
        subbufferIndex: ma_uint32,
        pBuffer: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_pcm_rb_get_format(pRB: *const ma_pcm_rb) -> ma_format;
}
extern "C" {
    pub fn ma_pcm_rb_get_channels(pRB: *const ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_sample_rate(pRB: *const ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_set_sample_rate(pRB: *mut ma_pcm_rb, sampleRate: ma_uint32);
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_duplex_rb {
    pub rb: ma_pcm_rb,
}
#[test]
fn bindgen_test_layout_ma_duplex_rb() {
    const UNINIT: ::std::mem::MaybeUninit<ma_duplex_rb> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_duplex_rb>(),
        152usize,
        concat!("Size of: ", stringify!(ma_duplex_rb))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_duplex_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_duplex_rb))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_duplex_rb),
            "::",
            stringify!(rb)
        )
    );
}
extern "C" {
    pub fn ma_duplex_rb_init(
        captureFormat: ma_format,
        captureChannels: ma_uint32,
        sampleRate: ma_uint32,
        captureInternalSampleRate: ma_uint32,
        captureInternalPeriodSizeInFrames: ma_uint32,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_duplex_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_duplex_rb_uninit(pRB: *mut ma_duplex_rb) -> ma_result;
}
extern "C" {
    #[doc = "Miscellaneous Helpers"]
    pub fn ma_result_description(result: ma_result) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ma_malloc(
        sz: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_calloc(
        sz: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_realloc(
        p: *mut ::std::os::raw::c_void,
        sz: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_free(
        p: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_aligned_malloc(
        sz: usize,
        alignment: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_aligned_free(
        p: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_get_format_name(format: ma_format) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ma_blend_f32(
        pOut: *mut f32,
        pInA: *mut f32,
        pInB: *mut f32,
        factor: f32,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_get_bytes_per_sample(format: ma_format) -> ma_uint32;
}
extern "C" {
    pub fn ma_log_level_to_string(logLevel: ma_uint32) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Synchronization"]
    pub fn ma_spinlock_lock(pSpinlock: *mut ma_spinlock) -> ma_result;
}
extern "C" {
    pub fn ma_spinlock_lock_noyield(pSpinlock: *mut ma_spinlock) -> ma_result;
}
extern "C" {
    pub fn ma_spinlock_unlock(pSpinlock: *mut ma_spinlock) -> ma_result;
}
extern "C" {
    pub fn ma_mutex_init(pMutex: *mut ma_mutex) -> ma_result;
}
extern "C" {
    pub fn ma_mutex_uninit(pMutex: *mut ma_mutex);
}
extern "C" {
    pub fn ma_mutex_lock(pMutex: *mut ma_mutex);
}
extern "C" {
    pub fn ma_mutex_unlock(pMutex: *mut ma_mutex);
}
extern "C" {
    pub fn ma_event_init(pEvent: *mut ma_event) -> ma_result;
}
extern "C" {
    pub fn ma_event_uninit(pEvent: *mut ma_event);
}
extern "C" {
    pub fn ma_event_wait(pEvent: *mut ma_event) -> ma_result;
}
extern "C" {
    pub fn ma_event_signal(pEvent: *mut ma_event) -> ma_result;
}
#[repr(C)]
#[derive(Debug)]
pub struct ma_fence {
    pub e: ma_event,
    pub counter: ma_uint32,
}
